[Timeout] BlockStatement
webapp/scripts/actions.ts:11:40
 /**
  * Resets the global variables used by the action code.
  */
-export function resetCopyCache(): void {
-    copyCache = null;
-}
+export function resetCopyCache(): void {}
 
 /**

[Timeout] BlockStatement
webapp/scripts/actions.ts:20:78
  * @param event the form submission event
  * @param url the URL to send the POST request to
  */
-export async function handleSubmit(event: Event, url: string): Promise<void> {
-    // prevent the form from submitting the old-fashioned way
-    event.preventDefault();
-
-    // send a POST request to the server
-    await fetch(url, {
-        method: 'POST',
-        headers: {
-            'Content-Type': 'application/json'
-        },
-        body: JSON.stringify({
-            langName: getSelectedLanguage(),
-        })
-    }).then(response => response.json()).then(updatedTree => {
-        updateTree(updatedTree.html, updatedTree.nodeString, getSelectedMode(), getSelectedLanguage(), true);
-    });
-}
+export async function handleSubmit(event: Event, url: string): Promise<void> {}
 
 /**

[Timeout] ObjectLiteral
webapp/scripts/actions.ts:30:30
         headers: {
             'Content-Type': 'application/json'
         },
-        body: JSON.stringify({
-            langName: getSelectedLanguage(),
-        })
+        body: JSON.stringify({})
     }).then(response => response.json()).then(updatedTree => {
         updateTree(updatedTree.html, updatedTree.nodeString, getSelectedMode(), getSelectedLanguage(), true);

[Killed] ArrowFunction
webapp/scripts/actions.ts:33:13
         body: JSON.stringify({
             langName: getSelectedLanguage(),
         })
-    }).then(response => response.json()).then(updatedTree => {
+    }).then(() => undefined).then(updatedTree => {
         updateTree(updatedTree.html, updatedTree.nodeString, getSelectedMode(), getSelectedLanguage(), true);
     });
killedBy: start node button has correct effect clicking start node button results in a single node being added to the empty tree
statusReason: TypeError: Cannot read properties of undefined (reading 'html')

[Timeout] BlockStatement
webapp/scripts/actions.ts:33:62
         body: JSON.stringify({
             langName: getSelectedLanguage(),
         })
-    }).then(response => response.json()).then(updatedTree => {
-        updateTree(updatedTree.html, updatedTree.nodeString, getSelectedMode(), getSelectedLanguage(), true);
-    });
+    }).then(response => response.json()).then(updatedTree => {});
 }
 

[Timeout] BooleanLiteral
webapp/scripts/actions.ts:34:104
             langName: getSelectedLanguage(),
         })
     }).then(response => response.json()).then(updatedTree => {
-        updateTree(updatedTree.html, updatedTree.nodeString, getSelectedMode(), getSelectedLanguage(), true);
+        updateTree(updatedTree.html, updatedTree.nodeString, getSelectedMode(), getSelectedLanguage(), false);
     });
 }

[Timeout] StringLiteral
webapp/scripts/actions.ts:47:53
  */
 export async function handleLiteralChanged(textInput: HTMLInputElement): Promise<void> {
     const literalValue: string = textInput.value;
-    const treePath: string = textInput.getAttribute("data-tree-path");
+    const treePath: string = textInput.getAttribute("");
 
     if (initialValues.find(([path, value]) => path === treePath && value === literalValue)) {

[Killed] EqualityOperator
webapp/scripts/actions.ts:49:68
     const literalValue: string = textInput.value;
     const treePath: string = textInput.getAttribute("data-tree-path");
 
-    if (initialValues.find(([path, value]) => path === treePath && value === literalValue)) {
+    if (initialValues.find(([path, value]) => path === treePath && value !== literalValue)) {
         return;
     }
killedBy: delete, copy, and paste buttons behave correctly clicking paste on another element after copying one results in the correct tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"
Received: "VariableNode(\"Num\", List(LiteralNode(\"\")))"

[Killed] ConditionalExpression
webapp/scripts/actions.ts:49:68
     const literalValue: string = textInput.value;
     const treePath: string = textInput.getAttribute("data-tree-path");
 
-    if (initialValues.find(([path, value]) => path === treePath && value === literalValue)) {
+    if (initialValues.find(([path, value]) => path === treePath && true)) {
         return;
     }
killedBy: delete, copy, and paste buttons behave correctly clicking paste on another element after copying one results in the correct tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"
Received: "VariableNode(\"Num\", List(LiteralNode(\"\")))"

[Killed] ConditionalExpression
webapp/scripts/actions.ts:54:9
     }
 
     let focusedTreePath: string = null;
-    if (nextFocusElement != null) {
+    if (false) {
         focusedTreePath = nextFocusElement.getAttribute("data-tree-path");
     }
killedBy: input focus is preserved when the tree is updated input focus is preserved when a literal is edited and ENTER is pressed
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -   0
+ Received  + 562

+ <body>
+   
+

[Timeout] EqualityOperator
webapp/scripts/actions.ts:54:9
     }
 
     let focusedTreePath: string = null;
-    if (nextFocusElement != null) {
+    if (nextFocusElement == null) {
         focusedTreePath = nextFocusElement.getAttribute("data-tree-path");
     }

[Timeout] BlockStatement
webapp/scripts/actions.ts:58:79
         focusedTreePath = nextFocusElement.getAttribute("data-tree-path");
     }
 
-    await runAction("EditLiteralAction", treePath, [literalValue]).then(() => {
-        if (focusedTreePath == null) {
-            return;
-        }
-        let focusedElement: HTMLElement = document.querySelector(`[data-tree-path="${focusedTreePath}"]`);
-        if (focusedElement != null && focusedElement instanceof HTMLElement) {
-            focusedElement.focus();
-            if (focusedElement instanceof HTMLInputElement) {
-                focusedElement.select();
-            }
-        }
-    });
+    await runAction("EditLiteralAction", treePath, [literalValue]).then(() => {});
 }
 

[Timeout] StringLiteral
webapp/scripts/actions.ts:58:21
         focusedTreePath = nextFocusElement.getAttribute("data-tree-path");
     }
 
-    await runAction("EditLiteralAction", treePath, [literalValue]).then(() => {
+    await runAction("", treePath, [literalValue]).then(() => {
         if (focusedTreePath == null) {
             return;

[Timeout] EqualityOperator
webapp/scripts/actions.ts:59:13
     }
 
     await runAction("EditLiteralAction", treePath, [literalValue]).then(() => {
-        if (focusedTreePath == null) {
+        if (focusedTreePath != null) {
             return;
         }

[Timeout] ConditionalExpression
webapp/scripts/actions.ts:59:13
     }
 
     await runAction("EditLiteralAction", treePath, [literalValue]).then(() => {
-        if (focusedTreePath == null) {
+        if (false) {
             return;
         }

[Killed] StringLiteral
webapp/scripts/actions.ts:62:66
         if (focusedTreePath == null) {
             return;
         }
-        let focusedElement: HTMLElement = document.querySelector(`[data-tree-path="${focusedTreePath}"]`);
+        let focusedElement: HTMLElement = document.querySelector(``);
         if (focusedElement != null && focusedElement instanceof HTMLElement) {
             focusedElement.focus();
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to the next input element updates the tree correctly
statusReason: SyntaxError: '' is not a valid selector

[Killed] EqualityOperator
webapp/scripts/actions.ts:63:13
             return;
         }
         let focusedElement: HTMLElement = document.querySelector(`[data-tree-path="${focusedTreePath}"]`);
-        if (focusedElement != null && focusedElement instanceof HTMLElement) {
+        if (focusedElement == null && focusedElement instanceof HTMLElement) {
             focusedElement.focus();
             if (focusedElement instanceof HTMLInputElement) {
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to the next input element updates the tree correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "77"
Received: "44"

[Killed] BlockStatement
webapp/scripts/actions.ts:63:78
             return;
         }
         let focusedElement: HTMLElement = document.querySelector(`[data-tree-path="${focusedTreePath}"]`);
-        if (focusedElement != null && focusedElement instanceof HTMLElement) {
-            focusedElement.focus();
-            if (focusedElement instanceof HTMLInputElement) {
-                focusedElement.select();
-            }
-        }
+        if (focusedElement != null && focusedElement instanceof HTMLElement) {}
     });
 }
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -   0
+ Received  + 629

+ <body>
+   
+

[Killed] ConditionalExpression
webapp/scripts/actions.ts:65:17
         let focusedElement: HTMLElement = document.querySelector(`[data-tree-path="${focusedTreePath}"]`);
         if (focusedElement != null && focusedElement instanceof HTMLElement) {
             focusedElement.focus();
-            if (focusedElement instanceof HTMLInputElement) {
+            if (false) {
                 focusedElement.select();
             }
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to the next input element updates the tree correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "77"
Received: "44"

[Killed] BlockStatement
webapp/scripts/actions.ts:65:61
         let focusedElement: HTMLElement = document.querySelector(`[data-tree-path="${focusedTreePath}"]`);
         if (focusedElement != null && focusedElement instanceof HTMLElement) {
             focusedElement.focus();
-            if (focusedElement instanceof HTMLInputElement) {
-                focusedElement.select();
-            }
+            if (focusedElement instanceof HTMLInputElement) {}
         }
     });
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to the next input element updates the tree correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "77"
Received: "44"

[Killed] BlockStatement
webapp/scripts/actions.ts:80:102
  * @param dropdown the expr/type choice dropdown
  * @param kind the kind of dropdown (either "expr" or "type")
  */
-export async function handleDropdownChange(dropdown: HTMLSelectElement, kind: string): Promise<void> {
-    const selectedValue: string = dropdown.value;
-    const subtree: HTMLElement = dropdown.parentElement.parentElement;
-    const dataTreePath: string = subtree.getAttribute("data-tree-path");
-
-    let actionName: string;
-    if (kind === "type") {
-        actionName = "SelectTypeAction";
-    } else if (kind === "expr") {
-        actionName = "SelectExprAction";
-    } else {
-        displayError(`Unknown dropdown kind: ${kind}`);
-        return;
-    }
-
-    await runAction(actionName, dataTreePath, [selectedValue]);
-}
+export async function handleDropdownChange(dropdown: HTMLSelectElement, kind: string): Promise<void> {}
 
 /**
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Killed] StringLiteral
webapp/scripts/actions.ts:83:55
 export async function handleDropdownChange(dropdown: HTMLSelectElement, kind: string): Promise<void> {
     const selectedValue: string = dropdown.value;
     const subtree: HTMLElement = dropdown.parentElement.parentElement;
-    const dataTreePath: string = subtree.getAttribute("data-tree-path");
+    const dataTreePath: string = subtree.getAttribute("");
 
     let actionName: string;
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Killed] BlockStatement
webapp/scripts/actions.ts:86:26
     const dataTreePath: string = subtree.getAttribute("data-tree-path");
 
     let actionName: string;
-    if (kind === "type") {
-        actionName = "SelectTypeAction";
-    } else if (kind === "expr") {
+    if (kind === "type") {} else if (kind === "expr") {
         actionName = "SelectExprAction";
     } else {
killedBy: behaviour of manipulating trees with type selections is correct can select a simple type (int)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "TypeNode(\"IntType\", List())"
Received: "TypeChoiceNode()"

[Killed] ConditionalExpression
webapp/scripts/actions.ts:86:9
     const dataTreePath: string = subtree.getAttribute("data-tree-path");
 
     let actionName: string;
-    if (kind === "type") {
+    if (false) {
         actionName = "SelectTypeAction";
     } else if (kind === "expr") {
killedBy: behaviour of manipulating trees with type selections is correct can select a simple type (int)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "TypeNode(\"IntType\", List())"
Received: "TypeChoiceNode()"

[Timeout] StringLiteral
webapp/scripts/actions.ts:87:22
 
     let actionName: string;
     if (kind === "type") {
-        actionName = "SelectTypeAction";
+        actionName = "";
     } else if (kind === "expr") {
         actionName = "SelectExprAction";

[Killed] EqualityOperator
webapp/scripts/actions.ts:88:16
     let actionName: string;
     if (kind === "type") {
         actionName = "SelectTypeAction";
-    } else if (kind === "expr") {
+    } else if (kind !== "expr") {
         actionName = "SelectExprAction";
     } else {
killedBy: undo and redo buttons behave correctly undo button is enabled after an action
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "disabled"
Received array:     ["onclick", "id", "disabled"]

[Killed] ConditionalExpression
webapp/scripts/actions.ts:88:16
     let actionName: string;
     if (kind === "type") {
         actionName = "SelectTypeAction";
-    } else if (kind === "expr") {
+    } else if (false) {
         actionName = "SelectExprAction";
     } else {
killedBy: undo and redo buttons behave correctly undo button is enabled after an action
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "disabled"
Received array:     ["onclick", "id", "disabled"]

[NoCoverage] BlockStatement
webapp/scripts/actions.ts:90:12
         actionName = "SelectTypeAction";
     } else if (kind === "expr") {
         actionName = "SelectExprAction";
-    } else {
-        displayError(`Unknown dropdown kind: ${kind}`);
-        return;
-    }
+    } else {}
 
     await runAction(actionName, dataTreePath, [selectedValue]);

[Killed] ObjectLiteral
webapp/scripts/actions.ts:107:37
 export async function runAction(actionName: string, treePath: string, extraArgs: any[]): Promise<void> {
     const modeName: string = getSelectedMode();
     const langName: string = getSelectedLanguage();
-    return fetch("/process-action", {
-        method: "POST", headers: {"Content-Type": "application/json"}, body: JSON.stringify({
-            langName,
-            modeName,
-            actionName,
-            nodeString: lastNodeString,
-            treePath,
-            extraArgs
-        })
-    }).then(response => {
+    return fetch("/process-action", {}).then(response => {
         if (!response.ok) {
             return response.text().then(text => {
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Timeout] BlockStatement
webapp/scripts/actions.ts:116:25
             treePath,
             extraArgs
         })
-    }).then(response => {
-        if (!response.ok) {
-            return response.text().then(text => {
-                throw new ClickDeduceResponseError(text);
-            });
-        }
-        return response;
-    }).then(response => response.json()).then(updatedTree => {
+    }).then(response => {}).then(response => response.json()).then(updatedTree => {
         updateTree(updatedTree.html, updatedTree.nodeString, modeName, langName, true)
     }).catch(error => {

[Killed] ConditionalExpression
webapp/scripts/actions.ts:117:13
             extraArgs
         })
     }).then(response => {
-        if (!response.ok) {
+        if (false) {
             return response.text().then(text => {
                 throw new ClickDeduceResponseError(text);
killedBy: responses to server errors are appropriate error div contains the error message
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "test"
Received: "Unexpected token 'e', \"test\" is not valid JSON"

[Timeout] ConditionalExpression
webapp/scripts/actions.ts:117:13
             extraArgs
         })
     }).then(response => {
-        if (!response.ok) {
+        if (true) {
             return response.text().then(text => {
                 throw new ClickDeduceResponseError(text);

[Timeout] BlockStatement
webapp/scripts/actions.ts:118:49
         })
     }).then(response => {
         if (!response.ok) {
-            return response.text().then(text => {
-                throw new ClickDeduceResponseError(text);
-            });
+            return response.text().then(text => {});
         }
         return response;

[Timeout] BlockStatement
webapp/scripts/actions.ts:123:62
             });
         }
         return response;
-    }).then(response => response.json()).then(updatedTree => {
-        updateTree(updatedTree.html, updatedTree.nodeString, modeName, langName, true)
-    }).catch(error => {
+    }).then(response => response.json()).then(updatedTree => {}).catch(error => {
         displayError(error);
         useTreeFromHistory(treeHistoryIndex);

[Timeout] ArrowFunction
webapp/scripts/actions.ts:123:13
             });
         }
         return response;
-    }).then(response => response.json()).then(updatedTree => {
+    }).then(() => undefined).then(updatedTree => {
         updateTree(updatedTree.html, updatedTree.nodeString, modeName, langName, true)
     }).catch(error => {

[Timeout] BooleanLiteral
webapp/scripts/actions.ts:124:82
         }
         return response;
     }).then(response => response.json()).then(updatedTree => {
-        updateTree(updatedTree.html, updatedTree.nodeString, modeName, langName, true)
+        updateTree(updatedTree.html, updatedTree.nodeString, modeName, langName, false)
     }).catch(error => {
         displayError(error);

[Killed] BlockStatement
webapp/scripts/actions.ts:125:23
         return response;
     }).then(response => response.json()).then(updatedTree => {
         updateTree(updatedTree.html, updatedTree.nodeString, modeName, langName, true)
-    }).catch(error => {
-        displayError(error);
-        useTreeFromHistory(treeHistoryIndex);
-        // throw new ClickDeduceResponseError(error.message);
-    });
+    }).catch(error => {});
 }
 
killedBy: responses to server errors are appropriate error div becomes visible
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value:  "fade-in"
Received object: {"0": "error-message", "1": "fade-out"}

[Killed] BlockStatement
webapp/scripts/actions.ts:139:66
  *
  * @param event the triggering event
  */
-export async function clearTreeNode(event: Event): Promise<void> {
-    event.preventDefault();
-    if (contextMenuSelectedElement) {
-        const treePath: string = contextMenuSelectedElement.getAttribute("data-tree-path")
-        await runAction("DeleteAction", treePath, [])
-    }
-}
+export async function clearTreeNode(event: Event): Promise<void> {}
 
 /**
killedBy: delete, copy, and paste buttons behave correctly pressing delete clears the selected node
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ExprChoiceNode()"
Received: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"

[Killed] ConditionalExpression
webapp/scripts/actions.ts:141:9
  */
 export async function clearTreeNode(event: Event): Promise<void> {
     event.preventDefault();
-    if (contextMenuSelectedElement) {
+    if (false) {
         const treePath: string = contextMenuSelectedElement.getAttribute("data-tree-path")
         await runAction("DeleteAction", treePath, [])
killedBy: delete, copy, and paste buttons behave correctly pressing delete clears the selected node
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ExprChoiceNode()"
Received: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"

[Killed] BlockStatement
webapp/scripts/actions.ts:141:37
  */
 export async function clearTreeNode(event: Event): Promise<void> {
     event.preventDefault();
-    if (contextMenuSelectedElement) {
-        const treePath: string = contextMenuSelectedElement.getAttribute("data-tree-path")
-        await runAction("DeleteAction", treePath, [])
-    }
+    if (contextMenuSelectedElement) {}
 }
 
killedBy: delete, copy, and paste buttons behave correctly pressing delete clears the selected node
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ExprChoiceNode()"
Received: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"

[Killed] StringLiteral
webapp/scripts/actions.ts:142:74
 export async function clearTreeNode(event: Event): Promise<void> {
     event.preventDefault();
     if (contextMenuSelectedElement) {
-        const treePath: string = contextMenuSelectedElement.getAttribute("data-tree-path")
+        const treePath: string = contextMenuSelectedElement.getAttribute("")
         await runAction("DeleteAction", treePath, [])
     }
killedBy: delete, copy, and paste buttons behave correctly pressing delete clears the selected node
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ExprChoiceNode()"
Received: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"

[Timeout] BlockStatement
webapp/scripts/actions.ts:150:38
 /**
  * Copies the node string of the selected subtree to the copy cache.
  */
-export function copyTreeNode(): void {
-    copyCache = contextMenuSelectedElement.getAttribute("data-node-string");
-}
+export function copyTreeNode(): void {}
 
 /**

[Timeout] BlockStatement
webapp/scripts/actions.ts:159:54
  *
  * Executes the PasteAction.
  */
-export async function pasteTreeNode(): Promise<void> {
-    if (copyCache) {
-        const treePath = contextMenuSelectedElement.getAttribute("data-tree-path");
-        await runAction("PasteAction", treePath, [copyCache]);
-    }
-}
+export async function pasteTreeNode(): Promise<void> {}
 

[Timeout] ConditionalExpression
webapp/scripts/actions.ts:160:9
  * Executes the PasteAction.
  */
 export async function pasteTreeNode(): Promise<void> {
-    if (copyCache) {
+    if (true) {
         const treePath = contextMenuSelectedElement.getAttribute("data-tree-path");
         await runAction("PasteAction", treePath, [copyCache]);

[Timeout] ConditionalExpression
webapp/scripts/actions.ts:160:9
  * Executes the PasteAction.
  */
 export async function pasteTreeNode(): Promise<void> {
-    if (copyCache) {
+    if (false) {
         const treePath = contextMenuSelectedElement.getAttribute("data-tree-path");
         await runAction("PasteAction", treePath, [copyCache]);

[Timeout] StringLiteral
webapp/scripts/actions.ts:162:25
 export async function pasteTreeNode(): Promise<void> {
     if (copyCache) {
         const treePath = contextMenuSelectedElement.getAttribute("data-tree-path");
-        await runAction("PasteAction", treePath, [copyCache]);
+        await runAction("", treePath, [copyCache]);
     }
 }
