[Timeout] BlockStatement
webapp/scripts/initialise.ts:23:51
  *
  * Can be called again to reset the state of the app
  */
-export async function initialise(): Promise<void> {
-    resetInterfaceGlobals();
-    resetCopyCache();
-    await resetTreeManipulation();
-
-    tree = document.getElementById('tree') as HTMLDivElement;
-
-    panzoomInstance = panzoom(tree, {
-        bounds: false, boundsPadding: 0, zoomDoubleClickSpeed: 1,
-        onTouch: (e) => {
-            // TODO: cannot use on mobile currently
-            return false;  // tells the library to not preventDefault.
-        },
-        filterKey: () => {
-            return true;  // don't let panzoom handle this event:
-        }
-    });
-}
+export async function initialise(): Promise<void> {}
 
 (window as any).initialise = initialise;

[Timeout] ObjectLiteral
webapp/scripts/initialise.ts:30:37
 
     tree = document.getElementById('tree') as HTMLDivElement;
 
-    panzoomInstance = panzoom(tree, {
-        bounds: false, boundsPadding: 0, zoomDoubleClickSpeed: 1,
-        onTouch: (e) => {
-            // TODO: cannot use on mobile currently
-            return false;  // tells the library to not preventDefault.
-        },
-        filterKey: () => {
-            return true;  // don't let panzoom handle this event:
-        }
-    });
+    panzoomInstance = panzoom(tree, {});
 }
 

[Timeout] BooleanLiteral
webapp/scripts/initialise.ts:31:17
     tree = document.getElementById('tree') as HTMLDivElement;
 
     panzoomInstance = panzoom(tree, {
-        bounds: false, boundsPadding: 0, zoomDoubleClickSpeed: 1,
+        bounds: true, boundsPadding: 0, zoomDoubleClickSpeed: 1,
         onTouch: (e) => {
             // TODO: cannot use on mobile currently

[NoCoverage] BlockStatement
webapp/scripts/initialise.ts:32:25
 
     panzoomInstance = panzoom(tree, {
         bounds: false, boundsPadding: 0, zoomDoubleClickSpeed: 1,
-        onTouch: (e) => {
-            // TODO: cannot use on mobile currently
-            return false;  // tells the library to not preventDefault.
-        },
+        onTouch: (e) => {},
         filterKey: () => {
             return true;  // don't let panzoom handle this event:

[NoCoverage] BooleanLiteral
webapp/scripts/initialise.ts:34:20
         bounds: false, boundsPadding: 0, zoomDoubleClickSpeed: 1,
         onTouch: (e) => {
             // TODO: cannot use on mobile currently
-            return false;  // tells the library to not preventDefault.
+            return true;  // tells the library to not preventDefault.
         },
         filterKey: () => {

[NoCoverage] BlockStatement
webapp/scripts/initialise.ts:36:26
             // TODO: cannot use on mobile currently
             return false;  // tells the library to not preventDefault.
         },
-        filterKey: () => {
-            return true;  // don't let panzoom handle this event:
-        }
+        filterKey: () => {}
     });
 }

[NoCoverage] BooleanLiteral
webapp/scripts/initialise.ts:37:20
             return false;  // tells the library to not preventDefault.
         },
         filterKey: () => {
-            return true;  // don't let panzoom handle this event:
+            return false;  // don't let panzoom handle this event:
         }
     });
