[Timeout] BlockStatement
webapp/scripts/interface.ts:13:47
 /**
  * Resets the global variables used by the interface code.
  */
-export function resetInterfaceGlobals(): void {
-    contextMenuSelectedElement = null;
-    nextFocusElement = null;
-    errorDiv = document.getElementById('error-message') as HTMLDivElement;
-
-    document.addEventListener('contextmenu', openContextMenu);
-    document.addEventListener('click', closeContextMenu);
-    document.getElementById('custom-context-menu').style.display = 'none';
-}
+export function resetInterfaceGlobals(): void {}
 
 /**

[Killed] StringLiteral
webapp/scripts/interface.ts:20:29
 
     document.addEventListener('contextmenu', openContextMenu);
     document.addEventListener('click', closeContextMenu);
-    document.getElementById('custom-context-menu').style.display = 'none';
+    document.getElementById("").style.display = 'none';
 }
 
killedBy: server is online server thread is running
statusReason: TypeError: Cannot read properties of null (reading 'style')

[Killed] BlockStatement
webapp/scripts/interface.ts:31:70
  *
  * @param e the keydown event
  */
-export async function handleKeyDown(e: KeyboardEvent): Promise<void> {
-    if (e.key === 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
-        await handleTabPressed(e);
-    } else if (e.key === 'Enter' && e.target instanceof HTMLInputElement) {
-        e.preventDefault();
-        nextFocusElement = e.target;
-        await handleLiteralChanged(e.target);
-    }
-}
+export async function handleKeyDown(e: KeyboardEvent): Promise<void> {}
 
 /**
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -   0
+ Received  + 629

+ <body>
+   
+

[Killed] ConditionalExpression
webapp/scripts/interface.ts:32:9
  * @param e the keydown event
  */
 export async function handleKeyDown(e: KeyboardEvent): Promise<void> {
-    if (e.key === 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
+    if (false) {
         await handleTabPressed(e);
     } else if (e.key === 'Enter' && e.target instanceof HTMLInputElement) {
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -   0
+ Received  + 629

+ <body>
+   
+

[Killed] EqualityOperator
webapp/scripts/interface.ts:32:9
  * @param e the keydown event
  */
 export async function handleKeyDown(e: KeyboardEvent): Promise<void> {
-    if (e.key === 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
+    if (e.key !== 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
         await handleTabPressed(e);
     } else if (e.key === 'Enter' && e.target instanceof HTMLInputElement) {
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -   0
+ Received  + 629

+ <body>
+   
+

[Killed] BlockStatement
webapp/scripts/interface.ts:34:75
 export async function handleKeyDown(e: KeyboardEvent): Promise<void> {
     if (e.key === 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
         await handleTabPressed(e);
-    } else if (e.key === 'Enter' && e.target instanceof HTMLInputElement) {
-        e.preventDefault();
-        nextFocusElement = e.target;
-        await handleLiteralChanged(e.target);
-    }
+    } else if (e.key === 'Enter' && e.target instanceof HTMLInputElement) {}
 }
 
killedBy: user can perform a sequence of actions LArith: (1 + 2) * 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: ""

[Killed] EqualityOperator
webapp/scripts/interface.ts:34:16
 export async function handleKeyDown(e: KeyboardEvent): Promise<void> {
     if (e.key === 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
         await handleTabPressed(e);
-    } else if (e.key === 'Enter' && e.target instanceof HTMLInputElement) {
+    } else if (e.key !== 'Enter' && e.target instanceof HTMLInputElement) {
         e.preventDefault();
         nextFocusElement = e.target;
killedBy: user can perform a sequence of actions LArith: (1 + 2) * 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: ""

[Killed] BlockStatement
webapp/scripts/interface.ts:45:73
  * Changes the focus to the next input element when TAB is pressed.
  * @param e the keydown event
  */
-export async function handleTabPressed(e: KeyboardEvent): Promise<void> {
-    if (e.key === 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
-        e.preventDefault();
-        const activeInputPaths: string[] = getActiveInputs().map(input => input.getAttribute('data-tree-path'));
-        const targetOuterPath: string = e.target.getAttribute('data-tree-path');
-        let activeElemIndex = activeInputPaths.indexOf(targetOuterPath);
-        if (e.shiftKey) {
-            activeElemIndex -= 1;
-        } else {
-            activeElemIndex += 1;
-        }
-        if (activeElemIndex < 0) {
-            activeElemIndex = getActiveInputs().length - 1;
-        } else if (activeElemIndex >= getActiveInputs().length) {
-            activeElemIndex = 0;
-        }
-        nextFocusElement = getActiveInputs()[activeElemIndex];
-        nextFocusElement.focus();
-        if (nextFocusElement instanceof HTMLInputElement) {
-            nextFocusElement.select();
-        }
-        // nextFocusElement = null;
-    }
-}
+export async function handleTabPressed(e: KeyboardEvent): Promise<void> {}
 
 /**
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -   0
+ Received  + 629

+ <body>
+   
+

[Killed] ConditionalExpression
webapp/scripts/interface.ts:46:9
  * @param e the keydown event
  */
 export async function handleTabPressed(e: KeyboardEvent): Promise<void> {
-    if (e.key === 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
+    if (false) {
         e.preventDefault();
         const activeInputPaths: string[] = getActiveInputs().map(input => input.getAttribute('data-tree-path'));
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -   0
+ Received  + 629

+ <body>
+   
+

[Killed] EqualityOperator
webapp/scripts/interface.ts:46:9
  * @param e the keydown event
  */
 export async function handleTabPressed(e: KeyboardEvent): Promise<void> {
-    if (e.key === 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
+    if (e.key !== 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
         e.preventDefault();
         const activeInputPaths: string[] = getActiveInputs().map(input => input.getAttribute('data-tree-path'));
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -   0
+ Received  + 629

+ <body>
+   
+

[Killed] ArrowFunction
webapp/scripts/interface.ts:48:66
 export async function handleTabPressed(e: KeyboardEvent): Promise<void> {
     if (e.key === 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
         e.preventDefault();
-        const activeInputPaths: string[] = getActiveInputs().map(input => input.getAttribute('data-tree-path'));
+        const activeInputPaths: string[] = getActiveInputs().map(() => undefined);
         const targetOuterPath: string = e.target.getAttribute('data-tree-path');
         let activeElemIndex = activeInputPaths.indexOf(targetOuterPath);
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  <input
    class="literal"
-   data-tree-path="0-1-0"

[Killed] StringLiteral
webapp/scripts/interface.ts:49:63
     if (e.key === 'Tab' && (e.target instanceof HTMLInputElement || e.target instanceof HTMLSelectElement)) {
         e.preventDefault();
         const activeInputPaths: string[] = getActiveInputs().map(input => input.getAttribute('data-tree-path'));
-        const targetOuterPath: string = e.target.getAttribute('data-tree-path');
+        const targetOuterPath: string = e.target.getAttribute("");
         let activeElemIndex = activeInputPaths.indexOf(targetOuterPath);
         if (e.shiftKey) {
killedBy: tab cycling between input elements behaves correctly tabbing through the elements in order works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  <input
-   data-tree-path="0-1-0"
+   data-tree-path="0-0-0"

[Killed] ConditionalExpression
webapp/scripts/interface.ts:51:13
         const activeInputPaths: string[] = getActiveInputs().map(input => input.getAttribute('data-tree-path'));
         const targetOuterPath: string = e.target.getAttribute('data-tree-path');
         let activeElemIndex = activeInputPaths.indexOf(targetOuterPath);
-        if (e.shiftKey) {
+        if (true) {
             activeElemIndex -= 1;
         } else {
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -   0
+ Received  + 629

+ <body>
+   
+

[Killed] BlockStatement
webapp/scripts/interface.ts:51:25
         const activeInputPaths: string[] = getActiveInputs().map(input => input.getAttribute('data-tree-path'));
         const targetOuterPath: string = e.target.getAttribute('data-tree-path');
         let activeElemIndex = activeInputPaths.indexOf(targetOuterPath);
-        if (e.shiftKey) {
-            activeElemIndex -= 1;
-        } else {
+        if (e.shiftKey) {} else {
             activeElemIndex += 1;
         }
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then pressing shift + tab to another literal sets the focus to the previous input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  <input
    class="literal"
-   data-tree-path="0-0-0"

[Killed] AssignmentOperator
webapp/scripts/interface.ts:52:13
         const targetOuterPath: string = e.target.getAttribute('data-tree-path');
         let activeElemIndex = activeInputPaths.indexOf(targetOuterPath);
         if (e.shiftKey) {
-            activeElemIndex -= 1;
+            activeElemIndex += 1;
         } else {
             activeElemIndex += 1;
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then pressing shift + tab to another literal sets the focus to the previous input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -  7
+ Received  + 26

- <input
-   class="literal"
-   data-tree-path="0-0-0"

[Killed] BlockStatement
webapp/scripts/interface.ts:53:16
         let activeElemIndex = activeInputPaths.indexOf(targetOuterPath);
         if (e.shiftKey) {
             activeElemIndex -= 1;
-        } else {
-            activeElemIndex += 1;
-        }
+        } else {}
         if (activeElemIndex < 0) {
             activeElemIndex = getActiveInputs().length - 1;
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  <input
    class="literal"
-   data-tree-path="0-1-0"

[Killed] AssignmentOperator
webapp/scripts/interface.ts:54:13
         if (e.shiftKey) {
             activeElemIndex -= 1;
         } else {
-            activeElemIndex += 1;
+            activeElemIndex -= 1;
         }
         if (activeElemIndex < 0) {
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -   0
+ Received  + 629

+ <body>
+   
+

[Killed] ConditionalExpression
webapp/scripts/interface.ts:56:13
         } else {
             activeElemIndex += 1;
         }
-        if (activeElemIndex < 0) {
+        if (true) {
             activeElemIndex = getActiveInputs().length - 1;
         } else if (activeElemIndex >= getActiveInputs().length) {
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -   0
+ Received  + 629

+ <body>
+   
+

[Killed] EqualityOperator
webapp/scripts/interface.ts:56:13
         } else {
             activeElemIndex += 1;
         }
-        if (activeElemIndex < 0) {
+        if (activeElemIndex <= 0) {
             activeElemIndex = getActiveInputs().length - 1;
         } else if (activeElemIndex >= getActiveInputs().length) {
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then pressing shift + tab to another literal sets the focus to the previous input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -  7
+ Received  + 26

- <input
-   class="literal"
-   data-tree-path="0-0-0"

[Killed] EqualityOperator
webapp/scripts/interface.ts:58:20
         }
         if (activeElemIndex < 0) {
             activeElemIndex = getActiveInputs().length - 1;
-        } else if (activeElemIndex >= getActiveInputs().length) {
+        } else if (activeElemIndex < getActiveInputs().length) {
             activeElemIndex = 0;
         }
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  <input
    class="literal"
-   data-tree-path="0-1-0"

[Killed] ConditionalExpression
webapp/scripts/interface.ts:58:20
         }
         if (activeElemIndex < 0) {
             activeElemIndex = getActiveInputs().length - 1;
-        } else if (activeElemIndex >= getActiveInputs().length) {
+        } else if (true) {
             activeElemIndex = 0;
         }
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to another literal sets the focus to the next input element
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  <input
    class="literal"
-   data-tree-path="0-1-0"

[Survived] ConditionalExpression
webapp/scripts/interface.ts:63:13
         }
         nextFocusElement = getActiveInputs()[activeElemIndex];
         nextFocusElement.focus();
-        if (nextFocusElement instanceof HTMLInputElement) {
+        if (false) {
             nextFocusElement.select();
         }

[Survived] BlockStatement
webapp/scripts/interface.ts:63:59
         }
         nextFocusElement = getActiveInputs()[activeElemIndex];
         nextFocusElement.focus();
-        if (nextFocusElement instanceof HTMLInputElement) {
-            nextFocusElement.select();
-        }
+        if (nextFocusElement instanceof HTMLInputElement) {}
         // nextFocusElement = null;
     }

[Killed] BlockStatement
webapp/scripts/interface.ts:75:40
  *
  * Also clears the contextMenuSelectedElement.
  */
-export function clearHighlight(): void {
-    document.querySelector('.highlight')?.classList.remove('highlight');
-    contextMenuSelectedElement = null;
-}
+export function clearHighlight(): void {}
 
 /**
killedBy: delete, copy, and paste buttons behave correctly clicking paste on same element after copying it results in the same tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Survived] OptionalChaining
webapp/scripts/interface.ts:76:5
  * Also clears the contextMenuSelectedElement.
  */
 export function clearHighlight(): void {
-    document.querySelector('.highlight')?.classList.remove('highlight');
+    document.querySelector('.highlight').classList.remove('highlight');
     contextMenuSelectedElement = null;
 }

[Killed] BlockStatement
webapp/scripts/interface.ts:84:47
  * Opens the context menu on the subtree that was right-clicked.
  * @param e the mouse event
  */
-function openContextMenu(e: MouseEvent): void {
-    let target: EventTarget = e.target;
-    if (contextMenuSelectedElement !== null) {
-        // closes the context menu if it is already open
-        target = null;
-    }
-
-    while (target instanceof HTMLElement && !target.classList.contains('highlight')) {
-        target = target.parentElement;
-    }
-
-    if (target && target instanceof HTMLElement && !hasClassOrParentHasClass(target, 'phantom')) {
-        e.preventDefault();
-
-        contextMenuSelectedElement = target;
-
-        const menu = document.getElementById('custom-context-menu');
-        menu.style.display = 'block';
-        menu.style.left = e.pageX + 'px';
-        menu.style.top = e.pageY + 'px';
-    } else {
-        closeContextMenu(e);
-    }
-}
+function openContextMenu(e: MouseEvent): void {}
 
 /**
killedBy: delete, copy, and paste buttons behave correctly pressing delete clears the selected node
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ExprChoiceNode()"
Received: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"

[Killed] ConditionalExpression
webapp/scripts/interface.ts:86:9
  */
 function openContextMenu(e: MouseEvent): void {
     let target: EventTarget = e.target;
-    if (contextMenuSelectedElement !== null) {
+    if (false) {
         // closes the context menu if it is already open
         target = null;
killedBy: context menu behaves correctly right-clicking on the selected element again causes the context menu to disappear
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "none"
Received: "block"

[Killed] BlockStatement
webapp/scripts/interface.ts:86:46
  */
 function openContextMenu(e: MouseEvent): void {
     let target: EventTarget = e.target;
-    if (contextMenuSelectedElement !== null) {
-        // closes the context menu if it is already open
-        target = null;
-    }
+    if (contextMenuSelectedElement !== null) {}
 
     while (target instanceof HTMLElement && !target.classList.contains('highlight')) {
killedBy: context menu behaves correctly right-clicking on the selected element again causes the context menu to disappear
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "none"
Received: "block"

[Killed] BooleanLiteral
webapp/scripts/interface.ts:91:45
         target = null;
     }
 
-    while (target instanceof HTMLElement && !target.classList.contains('highlight')) {
+    while (target instanceof HTMLElement && target.classList.contains('highlight')) {
         target = target.parentElement;
     }
killedBy: delete, copy, and paste buttons behave correctly pressing delete clears the selected node
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ExprChoiceNode()"
Received: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"

[Killed] LogicalOperator
webapp/scripts/interface.ts:91:12
         target = null;
     }
 
-    while (target instanceof HTMLElement && !target.classList.contains('highlight')) {
+    while (target instanceof HTMLElement || !target.classList.contains('highlight')) {
         target = target.parentElement;
     }
killedBy: delete, copy, and paste buttons behave correctly pressing delete clears the selected node
statusReason: TypeError: Cannot read properties of null (reading 'classList')

[Killed] ConditionalExpression
webapp/scripts/interface.ts:95:9
         target = target.parentElement;
     }
 
-    if (target && target instanceof HTMLElement && !hasClassOrParentHasClass(target, 'phantom')) {
+    if (false) {
         e.preventDefault();
 
killedBy: delete, copy, and paste buttons behave correctly pressing delete clears the selected node
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ExprChoiceNode()"
Received: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"

[Killed] ConditionalExpression
webapp/scripts/interface.ts:95:9
         target = target.parentElement;
     }
 
-    if (target && target instanceof HTMLElement && !hasClassOrParentHasClass(target, 'phantom')) {
+    if (true) {
         e.preventDefault();
 
killedBy: context menu behaves correctly right-clicking another element when the context menu is out causes the context menu to disappear
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "none"
Received: "block"

[Killed] StringLiteral
webapp/scripts/interface.ts:101:30
         contextMenuSelectedElement = target;
 
         const menu = document.getElementById('custom-context-menu');
-        menu.style.display = 'block';
+        menu.style.display = "";
         menu.style.left = e.pageX + 'px';
         menu.style.top = e.pageY + 'px';
killedBy: context menu behaves correctly right-clicking an element causes the context menu to appear
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "block"
Received: ""

[Killed] BlockStatement
webapp/scripts/interface.ts:104:12
         menu.style.display = 'block';
         menu.style.left = e.pageX + 'px';
         menu.style.top = e.pageY + 'px';
-    } else {
-        closeContextMenu(e);
-    }
+    } else {}
 }
 
killedBy: context menu behaves correctly right-clicking another element when the context menu is out causes the context menu to disappear
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "none"
Received: "block"

[Killed] BlockStatement
webapp/scripts/interface.ts:113:48
  * Closes the context menu.
  * @param e the mouse event
  */
-function closeContextMenu(e: MouseEvent): void {
-    document.getElementById('custom-context-menu').style.display = 'none';
-    if (contextMenuSelectedElement !== null) {
-        clearHighlight();
-    }
-}
+function closeContextMenu(e: MouseEvent): void {}
 
 /**
killedBy: context menu behaves correctly the context menu disappears when clicking away
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "none"
Received: "block"

[Killed] EqualityOperator
webapp/scripts/interface.ts:115:9
  */
 function closeContextMenu(e: MouseEvent): void {
     document.getElementById('custom-context-menu').style.display = 'none';
-    if (contextMenuSelectedElement !== null) {
+    if (contextMenuSelectedElement === null) {
         clearHighlight();
     }
killedBy: delete, copy, and paste buttons behave correctly clicking paste on same element after copying it results in the same tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[Killed] BlockStatement
webapp/scripts/interface.ts:115:46
  */
 function closeContextMenu(e: MouseEvent): void {
     document.getElementById('custom-context-menu').style.display = 'none';
-    if (contextMenuSelectedElement !== null) {
-        clearHighlight();
-    }
+    if (contextMenuSelectedElement !== null) {}
 }
 
killedBy: delete, copy, and paste buttons behave correctly clicking paste on same element after copying it results in the same tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

[NoCoverage] BlockStatement
webapp/scripts/interface.ts:123:35
 /**
  * Zooms the tree to fit the container.
  */
-export function zoomToFit(): void {
-    const container: HTMLElement = document.getElementById('tree-container');
-    const firstSubtree: Element = tree.children[0];
-
-    const widthScale: number = container.clientWidth / firstSubtree.clientWidth;
-    const heightScale: number = container.clientHeight / firstSubtree.clientHeight;
-
-    const newScale: number = Math.min(widthScale, heightScale);
-
-    panzoomInstance.moveTo(0, 0);
-    panzoomInstance.zoomAbs(0, 0, newScale);
-}
+export function zoomToFit(): void {}
 
 /**

[NoCoverage] StringLiteral
webapp/scripts/interface.ts:124:60
  * Zooms the tree to fit the container.
  */
 export function zoomToFit(): void {
-    const container: HTMLElement = document.getElementById('tree-container');
+    const container: HTMLElement = document.getElementById("");
     const firstSubtree: Element = tree.children[0];
 

[NoCoverage] ArithmeticOperator
webapp/scripts/interface.ts:127:32
     const container: HTMLElement = document.getElementById('tree-container');
     const firstSubtree: Element = tree.children[0];
 
-    const widthScale: number = container.clientWidth / firstSubtree.clientWidth;
+    const widthScale: number = container.clientWidth * firstSubtree.clientWidth;
     const heightScale: number = container.clientHeight / firstSubtree.clientHeight;
 

[NoCoverage] ArithmeticOperator
webapp/scripts/interface.ts:128:33
     const firstSubtree: Element = tree.children[0];
 
     const widthScale: number = container.clientWidth / firstSubtree.clientWidth;
-    const heightScale: number = container.clientHeight / firstSubtree.clientHeight;
+    const heightScale: number = container.clientHeight * firstSubtree.clientHeight;
 
     const newScale: number = Math.min(widthScale, heightScale);

[NoCoverage] MethodExpression
webapp/scripts/interface.ts:130:30
     const widthScale: number = container.clientWidth / firstSubtree.clientWidth;
     const heightScale: number = container.clientHeight / firstSubtree.clientHeight;
 
-    const newScale: number = Math.min(widthScale, heightScale);
+    const newScale: number = Math.max(widthScale, heightScale);
 
     panzoomInstance.moveTo(0, 0);

[Killed] BlockStatement
webapp/scripts/interface.ts:143:48
  *
  * @param error the error to display, requires a 'message' property
  */
-export function displayError(error: any): void {
-    errorDiv.textContent = error.message;
-    errorDiv.classList.add('fade-in');
-    errorDiv.classList.remove('fade-out');
-    setTimeout(() => {
-        errorDiv.classList.add('fade-out');
-        errorDiv.classList.remove('fade-in');
-    }, 5000);
-}
+export function displayError(error: any): void {}
 
killedBy: responses to server errors are appropriate error div becomes visible
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value:  "fade-in"
Received object: {"0": "error-message", "1": "fade-out"}

[Killed] StringLiteral
webapp/scripts/interface.ts:145:28
  */
 export function displayError(error: any): void {
     errorDiv.textContent = error.message;
-    errorDiv.classList.add('fade-in');
+    errorDiv.classList.add("");
     errorDiv.classList.remove('fade-out');
     setTimeout(() => {
killedBy: responses to server errors are appropriate an error is thrown in the console
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ClickDeduceResponseError
Received constructor: DOMException

[Killed] BlockStatement
webapp/scripts/interface.ts:147:22
     errorDiv.textContent = error.message;
     errorDiv.classList.add('fade-in');
     errorDiv.classList.remove('fade-out');
-    setTimeout(() => {
-        errorDiv.classList.add('fade-out');
-        errorDiv.classList.remove('fade-in');
-    }, 5000);
+    setTimeout(() => {}, 5000);
 }
 
killedBy: responses to server errors are appropriate error div becomes invisible after a timeout
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value:  not "fade-in"
Received object:     {"0": "error-message", "1": "fade-in"}

[Killed] StringLiteral
webapp/scripts/interface.ts:148:32
     errorDiv.classList.add('fade-in');
     errorDiv.classList.remove('fade-out');
     setTimeout(() => {
-        errorDiv.classList.add('fade-out');
+        errorDiv.classList.add("");
         errorDiv.classList.remove('fade-in');
     }, 5000);
killedBy: responses to server errors are appropriate error div becomes invisible after a timeout
statusReason: SyntaxError: The token provided must not be empty.
