[Survived] ArrayDeclaration
webapp/scripts/treeManipulation.ts:6:87
 import {handleDropdownChange, handleLiteralChanged, runAction} from "./actions";
 import {clearHighlight, contextMenuSelectedElement, handleKeyDown} from "./interface";
 
-let treeHistory: { mode: string; html: string; nodeString: string; lang: string }[] = [];
+let treeHistory: { mode: string; html: string; nodeString: string; lang: string }[] = ["Stryker was here"];
 export let treeHistoryIndex: number = 0;
 let undoButton: HTMLButtonElement

[Survived] ArrayDeclaration
webapp/scripts/treeManipulation.ts:15:48
 let langSelector: HTMLSelectElement;
 
 export let activeInputs: HTMLElement[] = [];
-export let initialValues: [string, string][] = [];
+export let initialValues: [string, string][] = ["Stryker was here"];
 
 export let lastNodeString: string = "";

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:22:62
 /**
  * Resets the global variables used by the tree manipulation code.
  */
-export async function resetTreeManipulation(): Promise<void> {
-    treeHistory = [];
-    treeHistoryIndex = 0;
-    undoButton = document.getElementById('undoButton') as HTMLButtonElement;
-    redoButton = document.getElementById('redoButton') as HTMLButtonElement;
-    activeInputs = [];
-    initialValues = [];
-    lastNodeString = "";
-
-    updateUndoRedoButtons();
-
-    modeRadios = Array.from(document.querySelectorAll('input[name="mode"]'));
-    for (const radio of modeRadios) {
-        radio.addEventListener('change', () => {
-            runAction("IdentityAction", "", []);
-        });
-    }
-
-    await loadLangSelector().then(() => {
-        langSelector = document.getElementById('lang-selector') as HTMLSelectElement;
-    });
-}
+export async function resetTreeManipulation(): Promise<void> {}
 
 /**
killedBy: lang selector is correctly initialised on load lang selector is present
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Timeout] ArrayDeclaration
webapp/scripts/treeManipulation.ts:23:19
  * Resets the global variables used by the tree manipulation code.
  */
 export async function resetTreeManipulation(): Promise<void> {
-    treeHistory = [];
+    treeHistory = ["Stryker was here"];
     treeHistoryIndex = 0;
     undoButton = document.getElementById('undoButton') as HTMLButtonElement;

[Survived] ArrayDeclaration
webapp/scripts/treeManipulation.ts:27:20
     treeHistoryIndex = 0;
     undoButton = document.getElementById('undoButton') as HTMLButtonElement;
     redoButton = document.getElementById('redoButton') as HTMLButtonElement;
-    activeInputs = [];
+    activeInputs = ["Stryker was here"];
     initialValues = [];
     lastNodeString = "";

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:34:37
     updateUndoRedoButtons();
 
     modeRadios = Array.from(document.querySelectorAll('input[name="mode"]'));
-    for (const radio of modeRadios) {
-        radio.addEventListener('change', () => {
-            runAction("IdentityAction", "", []);
-        });
-    }
+    for (const radio of modeRadios) {}
 
     await loadLangSelector().then(() => {
killedBy: mode radio buttons behave correctly clicking the type-check mode button makes the correct request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"request": {"body": "{\"langName\":\"LArith\",\"modeName\":\"type-check\",\"actionName\":\"IdentityAction\",\"nodeString\":\"ExprChoiceNode()\",\"treePath\":\"\",\"extraArgs\":[]}", "headers": {"Content-Type": "application/json"}, "method": "POST"}, "url": "process-action"}
Received array: [{"request": {"method": "

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:35:48
 
     modeRadios = Array.from(document.querySelectorAll('input[name="mode"]'));
     for (const radio of modeRadios) {
-        radio.addEventListener('change', () => {
-            runAction("IdentityAction", "", []);
-        });
+        radio.addEventListener('change', () => {});
     }
 
killedBy: mode radio buttons behave correctly clicking the type-check mode button makes the correct request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"request": {"body": "{\"langName\":\"LArith\",\"modeName\":\"type-check\",\"actionName\":\"IdentityAction\",\"nodeString\":\"ExprChoiceNode()\",\"treePath\":\"\",\"extraArgs\":[]}", "headers": {"Content-Type": "application/json"}, "method": "POST"}, "url": "process-action"}
Received array: [{"request": {"method": "

[Killed] ArrayDeclaration
webapp/scripts/treeManipulation.ts:36:45
     modeRadios = Array.from(document.querySelectorAll('input[name="mode"]'));
     for (const radio of modeRadios) {
         radio.addEventListener('change', () => {
-            runAction("IdentityAction", "", []);
+            runAction("IdentityAction", "", ["Stryker was here"]);
         });
     }
killedBy: mode radio buttons behave correctly clicking the type-check mode button makes the correct request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"request": {"body": "{\"langName\":\"LArith\",\"modeName\":\"type-check\",\"actionName\":\"IdentityAction\",\"nodeString\":\"ExprChoiceNode()\",\"treePath\":\"\",\"extraArgs\":[]}", "headers": {"Content-Type": "application/json"}, "method": "POST"}, "url": "process-action"}

[Killed] StringLiteral
webapp/scripts/treeManipulation.ts:36:41
     modeRadios = Array.from(document.querySelectorAll('input[name="mode"]'));
     for (const radio of modeRadios) {
         radio.addEventListener('change', () => {
-            runAction("IdentityAction", "", []);
+            runAction("IdentityAction", "Stryker was here!", []);
         });
     }
killedBy: mode radio buttons behave correctly clicking the type-check mode button makes the correct request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"request": {"body": "{\"langName\":\"LArith\",\"modeName\":\"type-check\",\"actionName\":\"IdentityAction\",\"nodeString\":\"ExprChoiceNode()\",\"treePath\":\"\",\"extraArgs\":[]}", "headers": {"Content-Type": "application/json"}, "method": "POST"}, "url": "process-action"}

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:40:41
         });
     }
 
-    await loadLangSelector().then(() => {
-        langSelector = document.getElementById('lang-selector') as HTMLSelectElement;
-    });
+    await loadLangSelector().then(() => {});
 }
 
killedBy: start node button has correct effect clicking start node button results in a single node being added to the empty tree
statusReason: TypeError: Cannot set properties of undefined (setting 'value')

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:48:50
 /**
  * Loads the language selector HTML from the server and adds it to the DOM.
  */
-async function loadLangSelector(): Promise<void> {
-    const langSelectorContainer: HTMLDivElement = document.getElementById('lang-selector-div') as HTMLDivElement;
-
-    await fetch('get-lang-selector', {
-        method: 'GET'
-    }).then(response => response.json()).then(langSelector => {
-        langSelectorContainer.innerHTML = langSelector.langSelectorHtml;
-    }).then(() => {
-        const langSelector: HTMLElement = document.getElementById('lang-selector');
-        langSelector.addEventListener('change', () => {
-            if (lastNodeString !== "") {
-                runAction("IdentityAction", "", []);
-            }
-        })
-    });
-}
+async function loadLangSelector(): Promise<void> {}
 
 /**
killedBy: lang selector is correctly initialised on load lang selector is present
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ObjectLiteral
webapp/scripts/treeManipulation.ts:51:38
 async function loadLangSelector(): Promise<void> {
     const langSelectorContainer: HTMLDivElement = document.getElementById('lang-selector-div') as HTMLDivElement;
 
-    await fetch('get-lang-selector', {
-        method: 'GET'
-    }).then(response => response.json()).then(langSelector => {
+    await fetch('get-lang-selector', {}).then(response => response.json()).then(langSelector => {
         langSelectorContainer.innerHTML = langSelector.langSelectorHtml;
     }).then(() => {
killedBy: fetch is correctly mocked fetch returns the set response
statusReason: SyntaxError: Unexpected token 'T', "The reques"... is not valid JSON

[Killed] ArrowFunction
webapp/scripts/treeManipulation.ts:53:13
 
     await fetch('get-lang-selector', {
         method: 'GET'
-    }).then(response => response.json()).then(langSelector => {
+    }).then(() => undefined).then(langSelector => {
         langSelectorContainer.innerHTML = langSelector.langSelectorHtml;
     }).then(() => {
killedBy: server is online server thread is running
statusReason: TypeError: Cannot read properties of undefined (reading 'langSelectorHtml')

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:53:63
 
     await fetch('get-lang-selector', {
         method: 'GET'
-    }).then(response => response.json()).then(langSelector => {
-        langSelectorContainer.innerHTML = langSelector.langSelectorHtml;
-    }).then(() => {
+    }).then(response => response.json()).then(langSelector => {}).then(() => {
         const langSelector: HTMLElement = document.getElementById('lang-selector');
         langSelector.addEventListener('change', () => {
killedBy: server is online server thread is running
statusReason: TypeError: Cannot read properties of null (reading 'addEventListener')

[Timeout] BlockStatement
webapp/scripts/treeManipulation.ts:55:19
         method: 'GET'
     }).then(response => response.json()).then(langSelector => {
         langSelectorContainer.innerHTML = langSelector.langSelectorHtml;
-    }).then(() => {
-        const langSelector: HTMLElement = document.getElementById('lang-selector');
-        langSelector.addEventListener('change', () => {
-            if (lastNodeString !== "") {
-                runAction("IdentityAction", "", []);
-            }
-        })
-    });
+    }).then(() => {});
 }
 

[Killed] StringLiteral
webapp/scripts/treeManipulation.ts:56:67
     }).then(response => response.json()).then(langSelector => {
         langSelectorContainer.innerHTML = langSelector.langSelectorHtml;
     }).then(() => {
-        const langSelector: HTMLElement = document.getElementById('lang-selector');
+        const langSelector: HTMLElement = document.getElementById("");
         langSelector.addEventListener('change', () => {
             if (lastNodeString !== "") {
killedBy: server is online server thread is running
statusReason: TypeError: Cannot read properties of null (reading 'addEventListener')

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:57:55
         langSelectorContainer.innerHTML = langSelector.langSelectorHtml;
     }).then(() => {
         const langSelector: HTMLElement = document.getElementById('lang-selector');
-        langSelector.addEventListener('change', () => {
-            if (lastNodeString !== "") {
-                runAction("IdentityAction", "", []);
-            }
-        })
+        langSelector.addEventListener('change', () => {})
     });
 }
killedBy: behaviour of changing the selected language is correct changing the selected language with only the initial node present has correct effect
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "<select class=\"expr-dropdown\" data-tree-path=\"\" style=\"display: inline;\"><option value=\"\">Select Expr...</option><option value=\"Num\">Num</option><option value=\"Plus\">Plus</option><option value=\"Times\">Times</option></select>"

[Killed] StringLiteral
webapp/scripts/treeManipulation.ts:57:39
         langSelectorContainer.innerHTML = langSelector.langSelectorHtml;
     }).then(() => {
         const langSelector: HTMLElement = document.getElementById('lang-selector');
-        langSelector.addEventListener('change', () => {
+        langSelector.addEventListener("", () => {
             if (lastNodeString !== "") {
                 runAction("IdentityAction", "", []);
killedBy: behaviour of changing the selected language is correct changing the selected language with only the initial node present has correct effect
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "<select class=\"expr-dropdown\" data-tree-path=\"\" style=\"display: inline;\"><option value=\"\">Select Expr...</option><option value=\"Num\">Num</option><option value=\"Plus\">Plus</option><option value=\"Times\">Times</option></select>"

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:58:17
     }).then(() => {
         const langSelector: HTMLElement = document.getElementById('lang-selector');
         langSelector.addEventListener('change', () => {
-            if (lastNodeString !== "") {
+            if (lastNodeString === "") {
                 runAction("IdentityAction", "", []);
             }
killedBy: start new node button behaves correctly changing the selected language causes an identity action
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"request": {"body": "{\"langName\":\"LIf\",\"modeName\":\"edit\",\"actionName\":\"IdentityAction\",\"nodeString\":\"ExprChoiceNode()\",\"treePath\":\"\",\"extraArgs\":[]}", "headers": {"Content-Type": "application/json"}, "method": "POST"}, "url": "process-action"}
Received array: [{"request": {"method": "GET"}, "u

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:58:40
     }).then(() => {
         const langSelector: HTMLElement = document.getElementById('lang-selector');
         langSelector.addEventListener('change', () => {
-            if (lastNodeString !== "") {
-                runAction("IdentityAction", "", []);
-            }
+            if (lastNodeString !== "") {}
         })
     });
killedBy: behaviour of changing the selected language is correct changing the selected language with only the initial node present has correct effect
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

Expected: not "<select class=\"expr-dropdown\" data-tree-path=\"\" style=\"display: inline;\"><option value=\"\">Select Expr...</option><option value=\"Num\">Num</option><option value=\"Plus\">Plus</option><option value=\"Times\">Times</option></select>"

[Killed] StringLiteral
webapp/scripts/treeManipulation.ts:59:45
         const langSelector: HTMLElement = document.getElementById('lang-selector');
         langSelector.addEventListener('change', () => {
             if (lastNodeString !== "") {
-                runAction("IdentityAction", "", []);
+                runAction("IdentityAction", "Stryker was here!", []);
             }
         })
killedBy: start new node button behaves correctly changing the selected language causes an identity action
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"request": {"body": "{\"langName\":\"LIf\",\"modeName\":\"edit\",\"actionName\":\"IdentityAction\",\"nodeString\":\"ExprChoiceNode()\",\"treePath\":\"\",\"extraArgs\":[]}", "headers": {"Content-Type": "application/json"}, "method": "POST"}, "url": "process-action"}

[Timeout] ArrayDeclaration
webapp/scripts/treeManipulation.ts:59:49
         const langSelector: HTMLElement = document.getElementById('lang-selector');
         langSelector.addEventListener('change', () => {
             if (lastNodeString !== "") {
-                runAction("IdentityAction", "", []);
+                runAction("IdentityAction", "", ["Stryker was here"]);
             }
         })

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:76:141
  * @param lang the language to select
  * @param addToHistory whether to add this change to the history
  */
-export function updateTree(newTreeHtml: string, newNodeString: string, modeName: string, lang: string, addToHistory: boolean = false): void {
-    tree.innerHTML = newTreeHtml;
-    lastNodeString = newNodeString;
-    treeCleanup();
-    if (addToHistory && (treeHistory.length === 0 ||
-        (newTreeHtml !== treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
-        if (treeHistoryIndex < treeHistory.length - 1) {
-            treeHistory = treeHistory.slice(0, treeHistoryIndex + 1);
-        }
-        const newEntry: { mode: string; html: string; nodeString: string; lang: string } = {
-            html: newTreeHtml,
-            nodeString: newNodeString,
-            mode: modeName,
-            lang,
-        };
-        treeHistoryIndex = treeHistory.push(newEntry) - 1;
-    }
-    updateUndoRedoButtons();
-    updateActiveInputsList();
-    modeRadios.forEach(radio => {
-        radio.checked = radio.value === modeName;
-    });
-    langSelector.value = lang;
-}
+export function updateTree(newTreeHtml: string, newNodeString: string, modeName: string, lang: string, addToHistory: boolean = false): void {}
 
 /**
killedBy: undo and redo buttons behave correctly undo button is enabled after an action
statusReason: TypeError: Cannot read properties of null (reading 'value')

[NoCoverage] BooleanLiteral
webapp/scripts/treeManipulation.ts:76:128
  * @param lang the language to select
  * @param addToHistory whether to add this change to the history
  */
-export function updateTree(newTreeHtml: string, newNodeString: string, modeName: string, lang: string, addToHistory: boolean = false): void {
+export function updateTree(newTreeHtml: string, newNodeString: string, modeName: string, lang: string, addToHistory: boolean = true): void {
     tree.innerHTML = newTreeHtml;
     lastNodeString = newNodeString;

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:80:9
     tree.innerHTML = newTreeHtml;
     lastNodeString = newNodeString;
     treeCleanup();
-    if (addToHistory && (treeHistory.length === 0 ||
-        (newTreeHtml !== treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
+    if (true) {
         if (treeHistoryIndex < treeHistory.length - 1) {
             treeHistory = treeHistory.slice(0, treeHistoryIndex + 1);
killedBy: undo and redo buttons behave correctly undo button is disabled when there are no more history
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "disabled"
Received array: ["onclick", "id"]

[Killed] LogicalOperator
webapp/scripts/treeManipulation.ts:80:26
     tree.innerHTML = newTreeHtml;
     lastNodeString = newNodeString;
     treeCleanup();
-    if (addToHistory && (treeHistory.length === 0 ||
-        (newTreeHtml !== treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
+    if (addToHistory && (treeHistory.length === 0 && (newTreeHtml !== treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
         if (treeHistoryIndex < treeHistory.length - 1) {
             treeHistory = treeHistory.slice(0, treeHistoryIndex + 1);
killedBy: start node button has correct effect clicking start node button results in a single node being added to the empty tree
statusReason: TypeError: Cannot read properties of undefined (reading 'html')

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:81:10
     lastNodeString = newNodeString;
     treeCleanup();
     if (addToHistory && (treeHistory.length === 0 ||
-        (newTreeHtml !== treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
+        (newTreeHtml === treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
         if (treeHistoryIndex < treeHistory.length - 1) {
             treeHistory = treeHistory.slice(0, treeHistoryIndex + 1);
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to the next input element updates the tree correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "77"
Received: "44"

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:81:10
     lastNodeString = newNodeString;
     treeCleanup();
     if (addToHistory && (treeHistory.length === 0 ||
-        (newTreeHtml !== treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
+        (false))) {
         if (treeHistoryIndex < treeHistory.length - 1) {
             treeHistory = treeHistory.slice(0, treeHistoryIndex + 1);
killedBy: responses to server errors are appropriate error div contains the error message
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Stack overflow exception"
Received: "test"

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:82:13
     treeCleanup();
     if (addToHistory && (treeHistory.length === 0 ||
         (newTreeHtml !== treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
-        if (treeHistoryIndex < treeHistory.length - 1) {
+        if (treeHistoryIndex >= treeHistory.length - 1) {
             treeHistory = treeHistory.slice(0, treeHistoryIndex + 1);
         }
killedBy: user can perform a sequence of actions LArith: (1 + 2) * 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: ""

[Survived] ArithmeticOperator
webapp/scripts/treeManipulation.ts:82:32
     treeCleanup();
     if (addToHistory && (treeHistory.length === 0 ||
         (newTreeHtml !== treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
-        if (treeHistoryIndex < treeHistory.length - 1) {
+        if (treeHistoryIndex < treeHistory.length + 1) {
             treeHistory = treeHistory.slice(0, treeHistoryIndex + 1);
         }

[Survived] ArithmeticOperator
webapp/scripts/treeManipulation.ts:83:48
     if (addToHistory && (treeHistory.length === 0 ||
         (newTreeHtml !== treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
         if (treeHistoryIndex < treeHistory.length - 1) {
-            treeHistory = treeHistory.slice(0, treeHistoryIndex + 1);
+            treeHistory = treeHistory.slice(0, treeHistoryIndex - 1);
         }
         const newEntry: { mode: string; html: string; nodeString: string; lang: string } = {

[Survived] MethodExpression
webapp/scripts/treeManipulation.ts:83:27
     if (addToHistory && (treeHistory.length === 0 ||
         (newTreeHtml !== treeHistory[treeHistoryIndex].html || newNodeString !== treeHistory[treeHistoryIndex].nodeString))) {
         if (treeHistoryIndex < treeHistory.length - 1) {
-            treeHistory = treeHistory.slice(0, treeHistoryIndex + 1);
+            treeHistory = treeHistory;
         }
         const newEntry: { mode: string; html: string; nodeString: string; lang: string } = {

[Killed] ArithmeticOperator
webapp/scripts/treeManipulation.ts:91:28
             mode: modeName,
             lang,
         };
-        treeHistoryIndex = treeHistory.push(newEntry) - 1;
+        treeHistoryIndex = treeHistory.push(newEntry) + 1;
     }
     updateUndoRedoButtons();
killedBy: delete, copy, and paste buttons behave correctly clicking paste on another element after copying one results in the correct tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"
Received: "VariableNode(\"Num\", List(LiteralNode(\"\")))"

[Timeout] BlockStatement
webapp/scripts/treeManipulation.ts:95:33
     }
     updateUndoRedoButtons();
     updateActiveInputsList();
-    modeRadios.forEach(radio => {
-        radio.checked = radio.value === modeName;
-    });
+    modeRadios.forEach(radio => {});
     langSelector.value = lang;
 }

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:96:25
     updateUndoRedoButtons();
     updateActiveInputsList();
     modeRadios.forEach(radio => {
-        radio.checked = radio.value === modeName;
+        radio.checked = radio.value !== modeName;
     });
     langSelector.value = lang;
killedBy: behaviour of manipulating trees with type selections is correct can select a simple type (int)
statusReason: Error: expect(received).toBeTruthy()

Received: null

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:96:25
     updateUndoRedoButtons();
     updateActiveInputsList();
     modeRadios.forEach(radio => {
-        radio.checked = radio.value === modeName;
+        radio.checked = true;
     });
     langSelector.value = lang;
killedBy: behaviour of manipulating trees with type selections is correct can select a simple type (int)
statusReason: TypeError: Cannot set properties of null (setting 'selectedIndex')

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:107:30
  * Adds hover listeners to the tree, makes orphaned inputs read-only,
  * and updates the stored initial values of literal inputs.
  */
-function treeCleanup(): void {
-    addHoverListeners();
-    addDropdownListeners();
-    makeOrphanedInputsReadOnly();
-    makePhantomInputsReadOnly();
-    setLiteralInitialValues();
-}
+function treeCleanup(): void {}
 
 /**
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:119:67
  * Updates the tree to the state it was in at the given history index.
  * @param newHistoryIndex the index of the tree history entry to use
  */
-export function useTreeFromHistory(newHistoryIndex: number): void {
-    if (newHistoryIndex >= 0 && newHistoryIndex < treeHistory.length) {
-        treeHistoryIndex = newHistoryIndex;
-        const entry = treeHistory[newHistoryIndex];
-        updateTree(entry.html, entry.nodeString, entry.mode, entry.lang, false);
-    }
-}
+export function useTreeFromHistory(newHistoryIndex: number): void {}
 
 /**
killedBy: delete, copy, and paste buttons behave correctly clicking paste after changing tree state makes the correct request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:120:9
  * @param newHistoryIndex the index of the tree history entry to use
  */
 export function useTreeFromHistory(newHistoryIndex: number): void {
-    if (newHistoryIndex >= 0 && newHistoryIndex < treeHistory.length) {
+    if (newHistoryIndex < 0 && newHistoryIndex < treeHistory.length) {
         treeHistoryIndex = newHistoryIndex;
         const entry = treeHistory[newHistoryIndex];
killedBy: undo and redo buttons behave correctly undo button is disabled when there are no more history
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "disabled"
Received array: ["onclick", "id"]

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:120:9
  * @param newHistoryIndex the index of the tree history entry to use
  */
 export function useTreeFromHistory(newHistoryIndex: number): void {
-    if (newHistoryIndex >= 0 && newHistoryIndex < treeHistory.length) {
+    if (newHistoryIndex > 0 && newHistoryIndex < treeHistory.length) {
         treeHistoryIndex = newHistoryIndex;
         const entry = treeHistory[newHistoryIndex];
killedBy: undo and redo buttons behave correctly undo button is disabled when there are no more history
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "disabled"
Received array: ["onclick", "id"]

[Survived] BooleanLiteral
webapp/scripts/treeManipulation.ts:123:74
     if (newHistoryIndex >= 0 && newHistoryIndex < treeHistory.length) {
         treeHistoryIndex = newHistoryIndex;
         const entry = treeHistory[newHistoryIndex];
-        updateTree(entry.html, entry.nodeString, entry.mode, entry.lang, false);
+        updateTree(entry.html, entry.nodeString, entry.mode, entry.lang, true);
     }
 }

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:130:47
 /**
  * Updates whether the undo/redo buttons are disabled.
  */
-export function updateUndoRedoButtons(): void {
-    undoButton.disabled = treeHistoryIndex <= 0;
-    redoButton.disabled = treeHistoryIndex >= treeHistory.length - 1;
-}
+export function updateUndoRedoButtons(): void {}
 
 /**
killedBy: undo and redo buttons behave correctly undo and redo buttons begin disabled
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "disabled"
Received array: ["onclick", "id"]

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:131:27
  * Updates whether the undo/redo buttons are disabled.
  */
 export function updateUndoRedoButtons(): void {
-    undoButton.disabled = treeHistoryIndex <= 0;
+    undoButton.disabled = treeHistoryIndex > 0;
     redoButton.disabled = treeHistoryIndex >= treeHistory.length - 1;
 }
killedBy: delete, copy, and paste buttons behave correctly clicking paste after changing tree state makes the correct request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality
