[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:131:27
  * Updates whether the undo/redo buttons are disabled.
  */
 export function updateUndoRedoButtons(): void {
-    undoButton.disabled = treeHistoryIndex <= 0;
+    undoButton.disabled = treeHistoryIndex < 0;
     redoButton.disabled = treeHistoryIndex >= treeHistory.length - 1;
 }
killedBy: undo and redo buttons behave correctly undo and redo buttons begin disabled
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "disabled"
Received array: ["onclick", "id"]

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:132:27
  */
 export function updateUndoRedoButtons(): void {
     undoButton.disabled = treeHistoryIndex <= 0;
-    redoButton.disabled = treeHistoryIndex >= treeHistory.length - 1;
+    redoButton.disabled = false;
 }
 
killedBy: undo and redo buttons behave correctly undo and redo buttons begin disabled
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "disabled"
Received array: ["onclick", "id"]

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:132:27
  */
 export function updateUndoRedoButtons(): void {
     undoButton.disabled = treeHistoryIndex <= 0;
-    redoButton.disabled = treeHistoryIndex >= treeHistory.length - 1;
+    redoButton.disabled = treeHistoryIndex > treeHistory.length - 1;
 }
 
killedBy: undo and redo buttons behave correctly undo and redo buttons begin disabled
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "disabled"
Received array: ["onclick", "id"]

[Timeout] BlockStatement
webapp/scripts/treeManipulation.ts:141:58
  * These automatically add and remove the highlight class to the subtree elements.
  */
 function addHoverListeners(): void {
-    document.querySelectorAll('.subtree').forEach(div => {
-        div.addEventListener('mouseover', (event) => {
-            // Stop the event from bubbling up to parent subtree elements
-            event.stopPropagation();
-            const target: EventTarget = event.currentTarget;
-
-            // Remove the highlight from any other subtree elements
-            if (contextMenuSelectedElement === null) {
-                document.querySelectorAll('.subtree').forEach(el => el.classList.remove('highlight'));
-                if (target instanceof HTMLElement) {
-                    // Add the highlight to the subtree currently hovered over
-                    target.classList.add('highlight');
-                }
-            }
-        });
-        div.addEventListener('mouseout', (event) => {
-            // Stop the event from bubbling up to parent subtree elements
-            event.stopPropagation();
-            // Remove the highlight from the currently hovered over subtree
-            if (contextMenuSelectedElement === null) {
-                clearHighlight();
-            }
-        });
-    });
+    document.querySelectorAll('.subtree').forEach(div => {});
 }
 

[Timeout] BlockStatement
webapp/scripts/treeManipulation.ts:142:54
  */
 function addHoverListeners(): void {
     document.querySelectorAll('.subtree').forEach(div => {
-        div.addEventListener('mouseover', (event) => {
-            // Stop the event from bubbling up to parent subtree elements
-            event.stopPropagation();
-            const target: EventTarget = event.currentTarget;
-
-            // Remove the highlight from any other subtree elements
-            if (contextMenuSelectedElement === null) {
-                document.querySelectorAll('.subtree').forEach(el => el.classList.remove('highlight'));
-                if (target instanceof HTMLElement) {
-                    // Add the highlight to the subtree currently hovered over
-                    target.classList.add('highlight');
-                }
-            }
-        });
+        div.addEventListener('mouseover', (event) => {});
         div.addEventListener('mouseout', (event) => {
             // Stop the event from bubbling up to parent subtree elements

[Timeout] StringLiteral
webapp/scripts/treeManipulation.ts:142:30
  */
 function addHoverListeners(): void {
     document.querySelectorAll('.subtree').forEach(div => {
-        div.addEventListener('mouseover', (event) => {
+        div.addEventListener("", (event) => {
             // Stop the event from bubbling up to parent subtree elements
             event.stopPropagation();

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:148:17
             const target: EventTarget = event.currentTarget;
 
             // Remove the highlight from any other subtree elements
-            if (contextMenuSelectedElement === null) {
+            if (false) {
                 document.querySelectorAll('.subtree').forEach(el => el.classList.remove('highlight'));
                 if (target instanceof HTMLElement) {
killedBy: hovering over a node behaves correctly mousing over a node highlights it
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value:  "highlight"
Received object: {"0": "subtree", "1": "axiom"}

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:148:17
             const target: EventTarget = event.currentTarget;
 
             // Remove the highlight from any other subtree elements
-            if (contextMenuSelectedElement === null) {
+            if (contextMenuSelectedElement !== null) {
                 document.querySelectorAll('.subtree').forEach(el => el.classList.remove('highlight'));
                 if (target instanceof HTMLElement) {
killedBy: delete, copy, and paste buttons behave correctly pressing delete clears the selected node
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ExprChoiceNode()"
Received: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"

[Survived] ArrowFunction
webapp/scripts/treeManipulation.ts:149:63
 
             // Remove the highlight from any other subtree elements
             if (contextMenuSelectedElement === null) {
-                document.querySelectorAll('.subtree').forEach(el => el.classList.remove('highlight'));
+                document.querySelectorAll('.subtree').forEach(() => undefined);
                 if (target instanceof HTMLElement) {
                     // Add the highlight to the subtree currently hovered over

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:150:21
             // Remove the highlight from any other subtree elements
             if (contextMenuSelectedElement === null) {
                 document.querySelectorAll('.subtree').forEach(el => el.classList.remove('highlight'));
-                if (target instanceof HTMLElement) {
+                if (false) {
                     // Add the highlight to the subtree currently hovered over
                     target.classList.add('highlight');
killedBy: hovering over a node behaves correctly mousing over a node highlights it
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value:  "highlight"
Received object: {"0": "subtree", "1": "axiom"}

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:150:52
             // Remove the highlight from any other subtree elements
             if (contextMenuSelectedElement === null) {
                 document.querySelectorAll('.subtree').forEach(el => el.classList.remove('highlight'));
-                if (target instanceof HTMLElement) {
-                    // Add the highlight to the subtree currently hovered over
-                    target.classList.add('highlight');
-                }
+                if (target instanceof HTMLElement) {}
             }
         });
killedBy: hovering over a node behaves correctly mousing over a node highlights it
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value:  "highlight"
Received object: {"0": "subtree", "1": "axiom"}

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:156:53
                 }
             }
         });
-        div.addEventListener('mouseout', (event) => {
-            // Stop the event from bubbling up to parent subtree elements
-            event.stopPropagation();
-            // Remove the highlight from the currently hovered over subtree
-            if (contextMenuSelectedElement === null) {
-                clearHighlight();
-            }
-        });
+        div.addEventListener('mouseout', (event) => {});
     });
 }
killedBy: hovering over a node behaves correctly mousing out from a highlighted node unhighlights it
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value:  not "highlight"
Received object:     {"0": "subtree", "1": "axiom", "2": "highlight"}

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:160:17
             // Stop the event from bubbling up to parent subtree elements
             event.stopPropagation();
             // Remove the highlight from the currently hovered over subtree
-            if (contextMenuSelectedElement === null) {
+            if (contextMenuSelectedElement !== null) {
                 clearHighlight();
             }
killedBy: hovering over a node behaves correctly mousing out from a highlighted node unhighlights it
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value:  not "highlight"
Received object:     {"0": "subtree", "1": "axiom", "2": "highlight"}

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:160:17
             // Stop the event from bubbling up to parent subtree elements
             event.stopPropagation();
             // Remove the highlight from the currently hovered over subtree
-            if (contextMenuSelectedElement === null) {
+            if (true) {
                 clearHighlight();
             }
killedBy: hovering over a node behaves correctly mousing out from a highlighted node while it is focused by the context menu does not unhighlight it
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value:  "highlight"
Received object: {"0": "subtree", "1": "axiom"}

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:167:39
     });
 }
 
-function addDropdownListeners(): void {
-    document.querySelectorAll('.expr-dropdown').forEach(select => {
-        if (select instanceof HTMLSelectElement) {
-            select.addEventListener('change', (event) => {
-                handleDropdownChange(select, 'expr');
-            })
-        }
-    });
-
-    document.querySelectorAll('.type-dropdown').forEach(select => {
-        if (select instanceof HTMLSelectElement) {
-            select.addEventListener('change', (event) => {
-                handleDropdownChange(select, 'type');
-            })
-        }
-    });
-}
+function addDropdownListeners(): void {}
 
 /**
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:168:67
 }
 
 function addDropdownListeners(): void {
-    document.querySelectorAll('.expr-dropdown').forEach(select => {
-        if (select instanceof HTMLSelectElement) {
-            select.addEventListener('change', (event) => {
-                handleDropdownChange(select, 'expr');
-            })
-        }
-    });
+    document.querySelectorAll('.expr-dropdown').forEach(select => {});
 
     document.querySelectorAll('.type-dropdown').forEach(select => {
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:169:50
 
 function addDropdownListeners(): void {
     document.querySelectorAll('.expr-dropdown').forEach(select => {
-        if (select instanceof HTMLSelectElement) {
-            select.addEventListener('change', (event) => {
-                handleDropdownChange(select, 'expr');
-            })
-        }
+        if (select instanceof HTMLSelectElement) {}
     });
 
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:169:13
 
 function addDropdownListeners(): void {
     document.querySelectorAll('.expr-dropdown').forEach(select => {
-        if (select instanceof HTMLSelectElement) {
+        if (false) {
             select.addEventListener('change', (event) => {
                 handleDropdownChange(select, 'expr');
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:170:58
 function addDropdownListeners(): void {
     document.querySelectorAll('.expr-dropdown').forEach(select => {
         if (select instanceof HTMLSelectElement) {
-            select.addEventListener('change', (event) => {
-                handleDropdownChange(select, 'expr');
-            })
+            select.addEventListener('change', (event) => {})
         }
     });
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Killed] StringLiteral
webapp/scripts/treeManipulation.ts:171:46
     document.querySelectorAll('.expr-dropdown').forEach(select => {
         if (select instanceof HTMLSelectElement) {
             select.addEventListener('change', (event) => {
-                handleDropdownChange(select, 'expr');
+                handleDropdownChange(select, "");
             })
         }
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Survived] BlockStatement
webapp/scripts/treeManipulation.ts:176:67
         }
     });
 
-    document.querySelectorAll('.type-dropdown').forEach(select => {
-        if (select instanceof HTMLSelectElement) {
-            select.addEventListener('change', (event) => {
-                handleDropdownChange(select, 'type');
-            })
-        }
-    });
+    document.querySelectorAll('.type-dropdown').forEach(select => {});
 }
 

[Survived] ConditionalExpression
webapp/scripts/treeManipulation.ts:177:13
     });
 
     document.querySelectorAll('.type-dropdown').forEach(select => {
-        if (select instanceof HTMLSelectElement) {
+        if (false) {
             select.addEventListener('change', (event) => {
                 handleDropdownChange(select, 'type');

[Survived] ConditionalExpression
webapp/scripts/treeManipulation.ts:177:13
     });
 
     document.querySelectorAll('.type-dropdown').forEach(select => {
-        if (select instanceof HTMLSelectElement) {
+        if (true) {
             select.addEventListener('change', (event) => {
                 handleDropdownChange(select, 'type');

[NoCoverage] BlockStatement
webapp/scripts/treeManipulation.ts:178:58
 
     document.querySelectorAll('.type-dropdown').forEach(select => {
         if (select instanceof HTMLSelectElement) {
-            select.addEventListener('change', (event) => {
-                handleDropdownChange(select, 'type');
-            })
+            select.addEventListener('change', (event) => {})
         }
     });

[Survived] BlockStatement
webapp/scripts/treeManipulation.ts:188:45
 /**
  * Makes all inputs without a data-tree-path attribute read-only.
  */
-function makeOrphanedInputsReadOnly(): void {
-    document.querySelectorAll('#tree select:not([data-tree-path]), #tree input:not([data-tree-path])').forEach(el => {
-        el.setAttribute('readonly', "true");
-        el.setAttribute('disabled', "true");
-    });
-}
+function makeOrphanedInputsReadOnly(): void {}
 
 /**

[Survived] BlockStatement
webapp/scripts/treeManipulation.ts:189:118
  * Makes all inputs without a data-tree-path attribute read-only.
  */
 function makeOrphanedInputsReadOnly(): void {
-    document.querySelectorAll('#tree select:not([data-tree-path]), #tree input:not([data-tree-path])').forEach(el => {
-        el.setAttribute('readonly', "true");
-        el.setAttribute('disabled', "true");
-    });
+    document.querySelectorAll('#tree select:not([data-tree-path]), #tree input:not([data-tree-path])').forEach(el => {});
 }
 

[Survived] StringLiteral
webapp/scripts/treeManipulation.ts:191:37
 function makeOrphanedInputsReadOnly(): void {
     document.querySelectorAll('#tree select:not([data-tree-path]), #tree input:not([data-tree-path])').forEach(el => {
         el.setAttribute('readonly', "true");
-        el.setAttribute('disabled', "true");
+        el.setAttribute('disabled', "");
     });
 }

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:198:44
 /**
  * Makes all inputs with the phantom class or part of a phantom subtree read-only.
  */
-function makePhantomInputsReadOnly(): void {
-    document.querySelectorAll('#tree select, #tree input').forEach(el => {
-        if (el instanceof HTMLElement && hasClassOrParentHasClass(el, 'phantom')) {
-            el.setAttribute('readonly', "true");
-            el.setAttribute('disabled', "true");
-        }
-    })
-}
+function makePhantomInputsReadOnly(): void {}
 
 /**
killedBy: phantom inputs are made read-only and disabled phantom inputs are made read-only and disabled
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "readonly"
Received array: ["type", "style", "data-tree-path", "value", "name"]

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:199:74
  * Makes all inputs with the phantom class or part of a phantom subtree read-only.
  */
 function makePhantomInputsReadOnly(): void {
-    document.querySelectorAll('#tree select, #tree input').forEach(el => {
-        if (el instanceof HTMLElement && hasClassOrParentHasClass(el, 'phantom')) {
-            el.setAttribute('readonly', "true");
-            el.setAttribute('disabled', "true");
-        }
-    })
+    document.querySelectorAll('#tree select, #tree input').forEach(el => {})
 }
 
killedBy: phantom inputs are made read-only and disabled phantom inputs are made read-only and disabled
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "readonly"
Received array: ["type", "style", "data-tree-path", "value", "name"]

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:200:13
  */
 function makePhantomInputsReadOnly(): void {
     document.querySelectorAll('#tree select, #tree input').forEach(el => {
-        if (el instanceof HTMLElement && hasClassOrParentHasClass(el, 'phantom')) {
+        if (true) {
             el.setAttribute('readonly', "true");
             el.setAttribute('disabled', "true");
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: TypeError: Cannot set properties of null (setting 'selectedIndex')

[Killed] LogicalOperator
webapp/scripts/treeManipulation.ts:200:13
  */
 function makePhantomInputsReadOnly(): void {
     document.querySelectorAll('#tree select, #tree input').forEach(el => {
-        if (el instanceof HTMLElement && hasClassOrParentHasClass(el, 'phantom')) {
+        if (el instanceof HTMLElement || hasClassOrParentHasClass(el, 'phantom')) {
             el.setAttribute('readonly', "true");
             el.setAttribute('disabled', "true");
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: TypeError: Cannot set properties of null (setting 'selectedIndex')

[Killed] StringLiteral
webapp/scripts/treeManipulation.ts:202:29
     document.querySelectorAll('#tree select, #tree input').forEach(el => {
         if (el instanceof HTMLElement && hasClassOrParentHasClass(el, 'phantom')) {
             el.setAttribute('readonly', "true");
-            el.setAttribute('disabled', "true");
+            el.setAttribute("", "true");
         }
     })
killedBy: phantom inputs are made read-only and disabled phantom inputs are made read-only and disabled
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received object: []

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:212:41
  *
  * Also adds event listeners to the inputs.
  */
-function updateActiveInputsList(): void {
-    activeInputs = Array.from(document.querySelectorAll('input[data-tree-path]:not([disabled]), select[data-tree-path]:not([disabled])'));
-    activeInputs.sort((a, b) => {
-        const aPath = a.getAttribute("data-tree-path");
-        const bPath = b.getAttribute("data-tree-path");
-        return aPath.localeCompare(bPath, undefined, {numeric: true, sensitivity: 'base'});
-    })
-    activeInputs.forEach(input => {
-        input.addEventListener('keydown', handleKeyDown);
-        if (input instanceof HTMLInputElement) {
-            input.addEventListener('change', () => handleLiteralChanged(input));
-            input.addEventListener('input', () => updateTextInputWidth(input));
-            input.addEventListener('blur', () => handleLiteralChanged(input));
-        }
-    })
-}
+function updateActiveInputsList(): void {}
 
 export function getActiveInputs(): HTMLElement[] {
killedBy: entering text into a literal input behaves correctly entering text makes the correct request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

[Survived] BlockStatement
webapp/scripts/treeManipulation.ts:214:33
  */
 function updateActiveInputsList(): void {
     activeInputs = Array.from(document.querySelectorAll('input[data-tree-path]:not([disabled]), select[data-tree-path]:not([disabled])'));
-    activeInputs.sort((a, b) => {
-        const aPath = a.getAttribute("data-tree-path");
-        const bPath = b.getAttribute("data-tree-path");
-        return aPath.localeCompare(bPath, undefined, {numeric: true, sensitivity: 'base'});
-    })
+    activeInputs.sort((a, b) => {})
     activeInputs.forEach(input => {
         input.addEventListener('keydown', handleKeyDown);

[Survived] MethodExpression
webapp/scripts/treeManipulation.ts:214:5
  */
 function updateActiveInputsList(): void {
     activeInputs = Array.from(document.querySelectorAll('input[data-tree-path]:not([disabled]), select[data-tree-path]:not([disabled])'));
-    activeInputs.sort((a, b) => {
-        const aPath = a.getAttribute("data-tree-path");
-        const bPath = b.getAttribute("data-tree-path");
-        return aPath.localeCompare(bPath, undefined, {numeric: true, sensitivity: 'base'});
-    })
+    activeInputs
     activeInputs.forEach(input => {
         input.addEventListener('keydown', handleKeyDown);

[Survived] BooleanLiteral
webapp/scripts/treeManipulation.ts:217:64
     activeInputs.sort((a, b) => {
         const aPath = a.getAttribute("data-tree-path");
         const bPath = b.getAttribute("data-tree-path");
-        return aPath.localeCompare(bPath, undefined, {numeric: true, sensitivity: 'base'});
+        return aPath.localeCompare(bPath, undefined, {numeric: false, sensitivity: 'base'});
     })
     activeInputs.forEach(input => {

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:219:35
         const bPath = b.getAttribute("data-tree-path");
         return aPath.localeCompare(bPath, undefined, {numeric: true, sensitivity: 'base'});
     })
-    activeInputs.forEach(input => {
-        input.addEventListener('keydown', handleKeyDown);
-        if (input instanceof HTMLInputElement) {
-            input.addEventListener('change', () => handleLiteralChanged(input));
-            input.addEventListener('input', () => updateTextInputWidth(input));
-            input.addEventListener('blur', () => handleLiteralChanged(input));
-        }
-    })
+    activeInputs.forEach(input => {})
 }
 
killedBy: delete, copy, and paste buttons behave correctly clicking paste on another element after copying one results in the correct tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"
Received: "VariableNode(\"Num\", List(LiteralNode(\"\")))"

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:221:13
     })
     activeInputs.forEach(input => {
         input.addEventListener('keydown', handleKeyDown);
-        if (input instanceof HTMLInputElement) {
+        if (false) {
             input.addEventListener('change', () => handleLiteralChanged(input));
             input.addEventListener('input', () => updateTextInputWidth(input));
killedBy: delete, copy, and paste buttons behave correctly clicking paste on another element after copying one results in the correct tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"
Received: "VariableNode(\"Num\", List(LiteralNode(\"\")))"

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:221:48
     })
     activeInputs.forEach(input => {
         input.addEventListener('keydown', handleKeyDown);
-        if (input instanceof HTMLInputElement) {
-            input.addEventListener('change', () => handleLiteralChanged(input));
-            input.addEventListener('input', () => updateTextInputWidth(input));
-            input.addEventListener('blur', () => handleLiteralChanged(input));
-        }
+        if (input instanceof HTMLInputElement) {}
     })
 }
killedBy: delete, copy, and paste buttons behave correctly clicking paste on another element after copying one results in the correct tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"
Received: "VariableNode(\"Num\", List(LiteralNode(\"\")))"

[Killed] ArrowFunction
webapp/scripts/treeManipulation.ts:222:46
     activeInputs.forEach(input => {
         input.addEventListener('keydown', handleKeyDown);
         if (input instanceof HTMLInputElement) {
-            input.addEventListener('change', () => handleLiteralChanged(input));
+            input.addEventListener('change', () => undefined);
             input.addEventListener('input', () => updateTextInputWidth(input));
             input.addEventListener('blur', () => handleLiteralChanged(input));
killedBy: delete, copy, and paste buttons behave correctly clicking paste on another element after copying one results in the correct tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "VariableNode(\"Num\", List(LiteralNode(\"foo\")))"
Received: "VariableNode(\"Num\", List(LiteralNode(\"\")))"

[Survived] ArrowFunction
webapp/scripts/treeManipulation.ts:223:45
         input.addEventListener('keydown', handleKeyDown);
         if (input instanceof HTMLInputElement) {
             input.addEventListener('change', () => handleLiteralChanged(input));
-            input.addEventListener('input', () => updateTextInputWidth(input));
+            input.addEventListener('input', () => undefined);
             input.addEventListener('blur', () => handleLiteralChanged(input));
         }

[Survived] StringLiteral
webapp/scripts/treeManipulation.ts:223:36
         input.addEventListener('keydown', handleKeyDown);
         if (input instanceof HTMLInputElement) {
             input.addEventListener('change', () => handleLiteralChanged(input));
-            input.addEventListener('input', () => updateTextInputWidth(input));
+            input.addEventListener("", () => updateTextInputWidth(input));
             input.addEventListener('blur', () => handleLiteralChanged(input));
         }
