[Killed] ArrowFunction
webapp/scripts/treeManipulation.ts:224:44
         if (input instanceof HTMLInputElement) {
             input.addEventListener('change', () => handleLiteralChanged(input));
             input.addEventListener('input', () => updateTextInputWidth(input));
-            input.addEventListener('blur', () => handleLiteralChanged(input));
+            input.addEventListener('blur', () => undefined);
         }
     })
killedBy: input focus is preserved when tabbing as the tree is updated editing a literal and then tabbing to the next input element updates the tree correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "77"
Received: "44"

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:236:36
 /**
  * Updates the list of initial values for literal inputs.
  */
-function setLiteralInitialValues() {
-    document.querySelectorAll('input[data-tree-path]').forEach(input => {
-        if (input instanceof HTMLInputElement) {
-            initialValues.push([input.getAttribute('data-tree-path'), input.value]);
-        }
-    });
-}
+function setLiteralInitialValues() {}
 
 /**
killedBy: entering text into a literal input behaves correctly if the input text is the same as it was before (blank), no server request is made
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 5

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:237:73
  * Updates the list of initial values for literal inputs.
  */
 function setLiteralInitialValues() {
-    document.querySelectorAll('input[data-tree-path]').forEach(input => {
-        if (input instanceof HTMLInputElement) {
-            initialValues.push([input.getAttribute('data-tree-path'), input.value]);
-        }
-    });
+    document.querySelectorAll('input[data-tree-path]').forEach(input => {});
 }
 
killedBy: entering text into a literal input behaves correctly if the input text is the same as it was before (blank), no server request is made
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 5

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:238:13
  */
 function setLiteralInitialValues() {
     document.querySelectorAll('input[data-tree-path]').forEach(input => {
-        if (input instanceof HTMLInputElement) {
+        if (false) {
             initialValues.push([input.getAttribute('data-tree-path'), input.value]);
         }
killedBy: entering text into a literal input behaves correctly if the input text is the same as it was before (blank), no server request is made
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 5

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:238:48
  */
 function setLiteralInitialValues() {
     document.querySelectorAll('input[data-tree-path]').forEach(input => {
-        if (input instanceof HTMLInputElement) {
-            initialValues.push([input.getAttribute('data-tree-path'), input.value]);
-        }
+        if (input instanceof HTMLInputElement) {}
     });
 }
killedBy: entering text into a literal input behaves correctly if the input text is the same as it was before (blank), no server request is made
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 5

[Killed] StringLiteral
webapp/scripts/treeManipulation.ts:239:52
 function setLiteralInitialValues() {
     document.querySelectorAll('input[data-tree-path]').forEach(input => {
         if (input instanceof HTMLInputElement) {
-            initialValues.push([input.getAttribute('data-tree-path'), input.value]);
+            initialValues.push([input.getAttribute(""), input.value]);
         }
     });
killedBy: responses to server errors are appropriate error div becomes visible
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value:  "fade-in"
Received object: {"0": "error-message", "1": "fade-out"}

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:247:30
 /**
  * Undoes the last change to the tree.
  */
-export function undo(): void {
-    if (treeHistoryIndex >= 0 && treeHistoryIndex < treeHistory.length) {
-        useTreeFromHistory(treeHistoryIndex - 1);
-    }
-}
+export function undo(): void {}
 
 /**
killedBy: delete, copy, and paste buttons behave correctly clicking paste after changing tree state makes the correct request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

[Killed] ConditionalExpression
webapp/scripts/treeManipulation.ts:248:9
  * Undoes the last change to the tree.
  */
 export function undo(): void {
-    if (treeHistoryIndex >= 0 && treeHistoryIndex < treeHistory.length) {
+    if (false) {
         useTreeFromHistory(treeHistoryIndex - 1);
     }
killedBy: delete, copy, and paste buttons behave correctly clicking paste after changing tree state makes the correct request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:248:73
  * Undoes the last change to the tree.
  */
 export function undo(): void {
-    if (treeHistoryIndex >= 0 && treeHistoryIndex < treeHistory.length) {
-        useTreeFromHistory(treeHistoryIndex - 1);
-    }
+    if (treeHistoryIndex >= 0 && treeHistoryIndex < treeHistory.length) {}
 }
 
killedBy: undo and redo buttons behave correctly undo button is disabled when there are no more history
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "disabled"
Received array: ["onclick", "id"]

[Killed] ArithmeticOperator
webapp/scripts/treeManipulation.ts:249:28
  */
 export function undo(): void {
     if (treeHistoryIndex >= 0 && treeHistoryIndex < treeHistory.length) {
-        useTreeFromHistory(treeHistoryIndex - 1);
+        useTreeFromHistory(treeHistoryIndex + 1);
     }
 }
killedBy: delete, copy, and paste buttons behave correctly clicking paste after changing tree state makes the correct request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

[Killed] BlockStatement
webapp/scripts/treeManipulation.ts:256:30
 /**
  * Redoes an undone change to the tree.
  */
-export function redo(): void {
-    if (treeHistoryIndex >= 0 && treeHistoryIndex < treeHistory.length - 1) {
-        useTreeFromHistory(treeHistoryIndex + 1);
-    }
-}
+export function redo(): void {}
 
 /**
killedBy: undo and redo buttons behave correctly pressing undo and then redo reverts the tree to the most recent state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 49
+ Received  + 17

- <div class="subtree" data-tree-path="" data-term="Plus(BlankExprDropDown(),BlankExprDropDown())" data-node-string="VariableNode(&quot;Plus&quot;, List(SubExprNode(ExprChoiceNode()), SubExprNode(ExprChoiceNode())))">
-   <div class="node">
-     <div class="scoped-variables" style="display: inline; padd

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:257:34
  * Redoes an undone change to the tree.
  */
 export function redo(): void {
-    if (treeHistoryIndex >= 0 && treeHistoryIndex < treeHistory.length - 1) {
+    if (treeHistoryIndex >= 0 && treeHistoryIndex >= treeHistory.length - 1) {
         useTreeFromHistory(treeHistoryIndex + 1);
     }
killedBy: undo and redo buttons behave correctly pressing undo and then redo reverts the tree to the most recent state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 49
+ Received  + 17

- <div class="subtree" data-tree-path="" data-term="Plus(BlankExprDropDown(),BlankExprDropDown())" data-node-string="VariableNode(&quot;Plus&quot;, List(SubExprNode(ExprChoiceNode()), SubExprNode(ExprChoiceNode())))">
-   <div class="node">
-     <div class="scoped-variables" style="display: inline; padd

[Killed] EqualityOperator
webapp/scripts/treeManipulation.ts:257:9
  * Redoes an undone change to the tree.
  */
 export function redo(): void {
-    if (treeHistoryIndex >= 0 && treeHistoryIndex < treeHistory.length - 1) {
+    if (treeHistoryIndex < 0 && treeHistoryIndex < treeHistory.length - 1) {
         useTreeFromHistory(treeHistoryIndex + 1);
     }
killedBy: undo and redo buttons behave correctly pressing undo and then redo reverts the tree to the most recent state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 49
+ Received  + 17

- <div class="subtree" data-tree-path="" data-term="Plus(BlankExprDropDown(),BlankExprDropDown())" data-node-string="VariableNode(&quot;Plus&quot;, List(SubExprNode(ExprChoiceNode()), SubExprNode(ExprChoiceNode())))">
-   <div class="node">
-     <div class="scoped-variables" style="display: inline; padd

[Killed] ArithmeticOperator
webapp/scripts/treeManipulation.ts:258:28
  */
 export function redo(): void {
     if (treeHistoryIndex >= 0 && treeHistoryIndex < treeHistory.length - 1) {
-        useTreeFromHistory(treeHistoryIndex + 1);
+        useTreeFromHistory(treeHistoryIndex - 1);
     }
 }
killedBy: undo and redo buttons behave correctly pressing undo and then redo reverts the tree to the most recent state
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 49
+ Received  + 17

- <div class="subtree" data-tree-path="" data-term="Plus(BlankExprDropDown(),BlankExprDropDown())" data-node-string="VariableNode(&quot;Plus&quot;, List(SubExprNode(ExprChoiceNode()), SubExprNode(ExprChoiceNode())))">
-   <div class="node">
-     <div class="scoped-variables" style="display: inline; padd

[Survived] BlockStatement
webapp/scripts/treeManipulation.ts:269:66
  *
  * @param textInput the text input to update
  */
-function updateTextInputWidth(textInput: HTMLInputElement): void {
-    const minWidth: number = 2;
-    textInput.style.width = Math.max(minWidth, textInput.value.length) + "ch";
-}
+function updateTextInputWidth(textInput: HTMLInputElement): void {}
 

[Survived] MethodExpression
webapp/scripts/treeManipulation.ts:271:29
  */
 function updateTextInputWidth(textInput: HTMLInputElement): void {
     const minWidth: number = 2;
-    textInput.style.width = Math.max(minWidth, textInput.value.length) + "ch";
+    textInput.style.width = Math.min(minWidth, textInput.value.length) + "ch";
 }
 

[Survived] StringLiteral
webapp/scripts/treeManipulation.ts:271:74
  */
 function updateTextInputWidth(textInput: HTMLInputElement): void {
     const minWidth: number = 2;
-    textInput.style.width = Math.max(minWidth, textInput.value.length) + "ch";
+    textInput.style.width = Math.max(minWidth, textInput.value.length) + "";
 }
 
