[Killed] BlockStatement
webapp/scripts/utils.ts:4:43
 /**
  * Get the value of the selected mode radio button.
  */
-export function getSelectedMode(): string {
-    const selectedRadio = document.querySelector('input[name="mode"]:checked') as HTMLInputElement | null;
-    if (selectedRadio) {
-        return selectedRadio.value;
-    }
-    throw new Error("No mode selected");
-}
+export function getSelectedMode(): string {}
 
 /**
killedBy: selecting an option from the expression choice dropdown has the correct effect selecting the "Num" option has correct effect
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received object: [<select class="expr-dropdown" data-tree-path="" style="display: inline;"><option value="">Select Expr...</option><option value="Num">Num</option><option value="Plus">Plus</option><option value="Times">Times</option></select>]

[Killed] ConditionalExpression
webapp/scripts/utils.ts:6:9
  */
 export function getSelectedMode(): string {
     const selectedRadio = document.querySelector('input[name="mode"]:checked') as HTMLInputElement | null;
-    if (selectedRadio) {
+    if (false) {
         return selectedRadio.value;
     }
killedBy: context menu behaves correctly context menu is initially hidden
statusReason: Error: No mode selected

[Killed] BlockStatement
webapp/scripts/utils.ts:6:24
  */
 export function getSelectedMode(): string {
     const selectedRadio = document.querySelector('input[name="mode"]:checked') as HTMLInputElement | null;
-    if (selectedRadio) {
-        return selectedRadio.value;
-    }
+    if (selectedRadio) {}
     throw new Error("No mode selected");
 }
killedBy: context menu behaves correctly context menu is initially hidden
statusReason: Error: No mode selected

[NoCoverage] StringLiteral
webapp/scripts/utils.ts:9:21
     if (selectedRadio) {
         return selectedRadio.value;
     }
-    throw new Error("No mode selected");
+    throw new Error("");
 }
 

[Killed] BlockStatement
webapp/scripts/utils.ts:15:47
 /**
  * Get the value of the selected language from the language selector.
  */
-export function getSelectedLanguage(): string {
-    const langSelector: HTMLSelectElement = document.getElementById('lang-selector') as HTMLSelectElement;
-    return langSelector.value;
-}
+export function getSelectedLanguage(): string {}
 
 /**
killedBy: start new node button behaves correctly clicking the button makes a request to the server
statusReason: Error: expect(received).toContainEqual(expected) // deep equality

Expected value: {"request": {"body": "{\"langName\":\"LArith\"}", "headers": {"Content-Type": "application/json"}, "method": "POST"}, "url": "start-node-blank"}
Received array: [{"request": {"method": "GET"}, "url": "get-lang-selector"}, {"request": {"body": "{}", "headers": {"Content-Type": "application/json"}, "method": "POST"},

[Killed] BlockStatement
webapp/scripts/utils.ts:26:92
  * @param element the element to begin the search from
  * @param className the class to search for
  */
-export function hasClassOrParentHasClass(element: HTMLElement, className: string): boolean {
-    return element.classList.contains(className) ||
-        (element.parentElement && hasClassOrParentHasClass(element.parentElement, className));
-}
+export function hasClassOrParentHasClass(element: HTMLElement, className: string): boolean {}
 
killedBy: phantom inputs are made read-only and disabled phantom inputs are made read-only and disabled
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "readonly"
Received array: ["type", "style", "data-tree-path", "value", "name"]

[Killed] LogicalOperator
webapp/scripts/utils.ts:27:12
  * @param className the class to search for
  */
 export function hasClassOrParentHasClass(element: HTMLElement, className: string): boolean {
-    return element.classList.contains(className) ||
-        (element.parentElement && hasClassOrParentHasClass(element.parentElement, className));
+    return element.classList.contains(className) && element.parentElement && hasClassOrParentHasClass(element.parentElement, className);
 }
 
killedBy: phantom inputs are made read-only and disabled phantom inputs are made read-only and disabled
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "readonly"
Received array: ["type", "style", "data-tree-path", "value", "name"]

[Killed] ConditionalExpression
webapp/scripts/utils.ts:27:12
  * @param className the class to search for
  */
 export function hasClassOrParentHasClass(element: HTMLElement, className: string): boolean {
-    return element.classList.contains(className) ||
-        (element.parentElement && hasClassOrParentHasClass(element.parentElement, className));
+    return true;
 }
 
killedBy: start new node button behaves correctly the contents of the tree div are replaced with the new tree HTML
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,9 +1,9 @@
  <div class="subtree axiom" data-tree-path="" data-term="BlankExprDropDown()" data-node-string="ExprChoiceNode()">
    <div class="expr">

[Killed] ConditionalExpression
webapp/scripts/utils.ts:28:10
  */
 export function hasClassOrParentHasClass(element: HTMLElement, className: string): boolean {
     return element.classList.contains(className) ||
-        (element.parentElement && hasClassOrParentHasClass(element.parentElement, className));
+        (false);
 }
 
killedBy: user can perform a sequence of actions LArith: (1 + 2) * 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: ""

[Killed] LogicalOperator
webapp/scripts/utils.ts:28:10
  */
 export function hasClassOrParentHasClass(element: HTMLElement, className: string): boolean {
     return element.classList.contains(className) ||
-        (element.parentElement && hasClassOrParentHasClass(element.parentElement, className));
+        (element.parentElement || hasClassOrParentHasClass(element.parentElement, className));
 }
 
killedBy: context menu behaves correctly context menu is initially hidden
statusReason: TypeError: Cannot read properties of undefined (reading 'value')
