[Timeout] BlockStatement
webapp/scripts/ClickDeduceResponseError.ts:2:32
 export class ClickDeduceResponseError extends Error {
-  constructor(message: string) {
-    super(message);
-    this.name = "ClickDeduceResponseError";
-    Object.setPrototypeOf(this, ClickDeduceResponseError.prototype)
-  }
+  constructor(message: string) {}
 }
 
